{"products": [{"link": "https://www.amazon.com/dp/B000052YIN", "title": "Gillette Series 3X Protection Shave Foam, Sensitive, 9 Ounce (Pack of 6)", "ratings": "231 ratings", "description": "Go easy on your sensitive skin with Gillette Series Sensitive Skin shave foam with aloe. The formulation delivers astonishing razor glide with its Triple Protection formula. It has a rich lather to help protect, lubricants for smooth glide, and it hydrates hair for easy cutting. So you get a smooth shave that's comfortable.", "reviews": ["Lo económico que resulta", "Have been using Gillette Foamy Shave Cream formulated for 'Sensitive Skin' for many years. And for just as long, have always set the can in the sink of medium hot water to warm up the cream before shaving. Never had one explode yet! My last order (from a different vendor) were different in the fact that there were no foil/paper labels on the cans, the labels were directly printed on the metallic cans and I never had to worry about the labels peeling off in the hot water. I noticed that this set of shaving cream have the foil/paper labels, so I suspect they are going to peel after a couple of uses, but no big deal. Just wish there would have been a way to know this before ordering.", "I made the mistake of purchasing this product, and meant to get the Gillette Series gel. I didn't know Gillette Series made shaving foam, too. Nevertheless, my rating of this product is not a reflection of my not knowing this (read: I will try to be as impartial as possible here!). I have since used this product, and it definitely is better than the foams I've used in the past. However, as other reviewers have noted, it's not as \"rich\" or full-bodied when it comes out of the can. The 'instructions' (nothing more than a graphic) does not say whether or not to shake the can (as with other foams). Either way (shake or no shake), when you dispense the product, it comes out rather thin, but seems to thicken up a bit, after a second or two. Overall, it's good foam, and I'd give it a higher rating if it wasn't for the 'watery' consistency when it comes out of the can. This can be a (minor) issue at first, as some if it might fall into the sink if you dispense it took quickly (as I have, before I got the hang of it and learned not to press the button too firmly).\n\nIn summary:\n* If you like foam, you may like this one. 3 stars for now, 4 1/2 stars if they can reformulate it to not be so runny upon dispensing.\n* If you prefer gel (as I do), you probably won't like it. However, I suggest trying it out buy buying a single can first, to see if you'd like it.", "I've been using this cream for some time now and I just realized I was able to get it in bulk packs and subscription services. I hate going out to the store to buy things like this (mainly because I wait until I'm out), so the subscription is good. If you are like me with 5 men in the house, you can probably use the six cans pretty easily. We aren't even that hairy of a bunch, so your mileage may vary based on your level of wolverinism and the number people you have.\n\nIn terms of the cream itself, I'm a big fan of foam over gel as you don't have to wait for it to foam, you get a better idea of how much you are using and I think it works better to lubricate and hydrate the face. Gillette's is good at all that. I don't have sensitive skin, but I've always used this because it seems easier on my face and it provides for a smooth shave.\n\nEverything said the cream itself is great, but a 6pk is a lot of shaving cream. Great if you have a lot of guys around (better yet if they are particularly hairy).", "Nice value for the dollar.\nNot sure what \"sheerness\" and \"thickness\" have to do with shaving cream so I can't \"rate\" them.\nI've used this cream exclusively for some time and it works well.", "This is a great shaving cream foam. Was worried it was going to be the gel.", "Gillette Sensitive Skin is my \"go-to\" brand when traveling and being able to grab six of them at slight less than $3.25 each rather than $2.30 for singles makes it easy for me to stock up. It is like getting almost three FREE cans with a three can purchase. Shelf life is not a problem either if kept in a cool place. No, the garage is a bad idea as is over the stove or on the mantle above the fireplace. This is a good deal.", "I wasn't able to buy my usual shaving foam (Barbasol) here on amazon.com without paying shipping and handling because for some reason only outside vendors carry it, so I decided to give something else a try, and this seemed like the best value. I haven't experienced any of the watery issues that some other reviewers have, and I wonder if it's perhaps because I hold the can upside down and shake vigourously before each use. Take note, this is a foam, not a gel, and it comes out all foam. I use it on my face and my head, and it does the job, with no bad smell or irritation. Not much you can say...it's shaving foam. It is what it is.", "I switched to the gel style shave products many moons ago when they first became popular. Then recently, by accident, I picked one of these Gillete foam styles off the store shelf. Because I didn't realize my mistake until a couple of weeks later, I decided to use it. I was pleasantly surprised to discover how much closer and easier it shaved compared to the gels. I tried brand B foam later and it seemed to be more air less moisture. The Gillete product does come out less puffed up, which is due, I'm speculating, to a higher moisture content. So the Gillette Foam is now my daily shave product.", "The can looked like the one he likes however it wasn't the gel he thought it would be. He still uses it and says it's ok.", "The item arrived when I was notified it would arrive - in a timely manner. Looks like I am all set with shaving cream for the near future.", "I've used Gillette Series foam for years...have never been a fan of gels. I get a great shave with the foam, and with a lot less mess, and a lot less odor. I can't believe that a product as good as this is so hard to find. Well, not anymore with Amazon.", "I ordered this six pack in 2012 and JUST popped open that sixth can. So keep that in mind if you're trying to order in bulk to save money, this purchase is probably way longer term than you're thinking. Also, I thought I was buying the gel, but this is the cream.", "Couldn't find this in Walmart or Riteaid anymore so looked for it on amazon. Had to buy the six pack, but since it doesn't really expire I'll be set for a few years, haha. I like this cream because it doesn't clog my Gillette fusion razor like the foaming gel does.", "Shaving", "My absolute favorite shaving cream. I have sensitive skin on my neck, and this one is waaaaaay better than gels, which seem to bog down my electric razor. These will probably last a couple of years", "Purchased for a sensory item for play.", "This stuff is classic, works great and is impossible to find anymore even in the million drugstores of NYC. I hope they are not dis-continuing the product. It seems only the razor-clogging gels are being sold in NYC these days, so I had to buy 6 cans of these just so I could get what I wanted!", "Been using these for years now. A little goes a long way. Comes out like water then foams up. This is important to note so that you do not dispense too much after thinking there was no foam coming out. I find it better to shake the can 2 or 3 times (not excessively) to make it foam up quicker.", "This product is great. The price was right and the shaves are great."], "img": "https://m.media-amazon.com/images/I/51+byPR+iTL._SY300_SX300_.jpg"}, {"link": "https://www.amazon.com/dp/B00005308K", "title": "Secret Original Anti-Perspirant/Deodorant, Invisible Solid, Powder Fresh, 2.6-Ounces", "ratings": "1,343 ratings", "description": "Aluminum Zirconium Trichlorohydrex GLY. Invisible sheer dry strength.", "reviews": ["This is the best I have found. It has a light scent and lasts all day. I will keep ordering.", "The deodorant works well but you must turn a knob on the bottom to get it out and in the beginning it is impossible to turn. I was disappointed that I bought this.", "I have struggled with hyperhydrosis my whole life. I was bullied in school for my large pit-stains, and would always have wet circles under my pits, regardless of the temperature outside. I went through several prescriptions from my doctor, which only irritated my skin and made it itch and burn like fire, preventing me from sleep. I received a sample of this product through a female care sample pack through a clinic, and fell in love. I have now been using this deodorant for almost 10 years, and have never been happier with a deodorant. Yes, I still do sweat if it's really hot out, or while working, but that's to be given with any deodorant I believe. Applying this product at night and in the morning has solved the huge wet circles I was always embarrassed of.\n\nAlso, this product smells fantastic, and has not irritated my skin even after applying twice daily. I am so happy with this, that i haven't, and won't search for anything else. This is it for me!", "I was given a trial of this somewhere. I forgot about it and when I used it, it was a bit dry and hard to get out, but worked well. Now that I have a fresh one, it it much nicer to use! I only roll it up one \"click\" and put it on; you don't need much. But, my complaint is how darn hard it is to turn that dial, If you have hand issues, this may not be for you. I do not like smells in my products, but bought this because people said the smell was light and i either couldn't find or didn't want the fragrance free one (cannot remember now). The fragrance is not bad. It is lighter than many and doesn't smell for long. That said, if you are sensitive to fragrance, it is noticeable when you put it on.\n\nHave no idea how long it will last - given it's price, I hope longer than the last kind I used.", "Been using exactly this brand, exactly this scent since it came out. This deodorant, seriously changed my whole life. I have always been a sweaty armpit person (not a smelly sweaty, but constant sweat), and was SO insecure about it. All through junior high and high school I always wore a jacket over clothes, and didn't like wearing anything but colors that could hide the sweat, which was there even in the middle of winter. I put this on after showering, and don't have to reapply until my next shower, even if that is two days later. I thought maybe I grew out of the problem, but have tried over the years not using it, and a couple of times have forgotten it when I traveled, and I definitely still sweat like crazy. No other deodorant works even a little for me. This is THE ONLY one I can use with success. And it smells awesome! People sometimes ask me what perfume I'm wearing, and I tell them it's my D.O., haha. I don't like the other scents this deodorant has, and have a special aversion to the 'powder' scent (gag).", "Definitely one of my best and trusted tried and true, Go-Tod. Easy application, lasts longer than competitors, nice scent, and great odour protection!", "This has been my favorite deodorant for years, but now that we’ve moved from the desert to a warm humid climate this is a life saver. I’ve tried switching to the more natural (aluminum free) deodorants that everyone raves about, but I end up smelling and with soaked T-shirt’s. Secret clinical strength never fails me, and I love the fresh light scent that doesn’t overpower. I can wear this deodorant on a day I’m nauseous no issues, and if I’m wearing perfume it doesn’t clash like some stronger smelling brands of deodorant have in the past.", "Can go up to 2 days without sweating ..I've tried natural deoderants and aluminum free but I hate the feeling of wet pits..keeps me super dry and the smell is so fresh ..my favorite..definitely worth the cost", "I love this deodorant. The smell is delicate and pleasant. It works well. I had to wait 4 weeks to get it but it was worth the wait.", "I dislike the overpowering fragrance of most depressant but I appreciate a light scent versus unscented. This is the perfect balance and it does and excellent job", "It's a very good product and does what it says so long as you follow directions. I used this in preparation for a summer wedding and I'm so glad I did. Just remember you have to start using well before the date of your event in order for it to be fully effective though I have used it on shorter notice occasionally and it still seems to work fine. Amazon occasionally has a coupon that can make this really cheap so clip it and just add one of these to your prime or free shipping order since it's an add-on item and will only cost a few bucks. It's worth it to have one on hand when you need it.", "i'm somewhat disappointed with the scent. To me, it really doesn't smell like lavender. Now I wish I'd gotten (if they have it) the \"clean\" scent in the clear gel. The scent It isn't bad, I just wanted something \"pretty\" like my last one (which was called \"Paris\"). But, I didn't see that one. As for the antiperspirant part, it's decent but could be better.", "Have used this for years bit was buying in Amazon. This sounded like a good scent. I needed some and like it. It is not a heavy scent", "Gentle fragrance and works all day well.", "Useful and easy.", "Wasn't sure of the directions at first, of it was two clicks for each arm or one for each. The feeling of the deodorant is a little strange at first, but it does feel dry when it goes on, almost too dry.\n\nI reapplied about half a click to both arms in the morning because I didn't trust it to last throughout the next day as well and I was right. I was sweating all day and smelled by the end of the day. Now this could be because I didn't use it right, I'm not sure. These deodorants always speak to the sweating, but not the odor which is my main concern.\n\nI will increase two two clicks each arm day and night. This means I will be out of deodorant by next week probably with tiny amount that's in there, but it's worth a try.", "I am trying out new deodorants because my old, reliable deodorant, Arrid XX Dry changed its formula. I tried Secret because it's the best seller on Amazon. So far this product is just okay. Good points:\n- The lavender scent is mild and pleasant, not overpowering.\n- It seems to keep me smelling fresh.\n\nI'm not giving it a higher rating because:\n- The gel is extremely sticky/tacky and stays that way all day without ever absorbing into my skin although I apply a very small amount (1-click). I wash it off before bed because the stickiness is unpleasant.\n- It transfers to my clothing, leaving a dark, hardened spot on the fabric, which is very undesirable. I let it dry for about 30 minutes before dressing and it still transfers.", "This is the best deodorant i’ve been using it for years. Love the smell and it really controls perspiration. Wouldn’t change it!", "Arrived exactly as advertised", "Love this stuff but the one time I buy it online and the container itself is broken. Won't roll up or down and the piece of plastic in the middle is poking out at the top. Ugh...smh"], "img": "https://m.media-amazon.com/images/I/41ddNlDqsTL._SX425_.jpg"}, {"link": "https://www.amazon.com/dp/B00005368L", "title": "Natracare Non-Applicator 100% Organic Cotton Tampons, Regular, Totally Chlorine Free, Biodegradable and Compostable (1 Pack, 20 Tampons Total)", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/81+gP6x+ZBS._AC_SX679_.jpg", "ratings": "915 ratings", "description": "Our regular organic tampons are made with a rolled wadding of long-fibre organic cotton – designed to gently absorb menstrual flow and expand widthways. We only make organic tampons because most are made from a mix of rayon and non-organic cotton, and are commonly chlorine-bleached. Tampons often have a plastic wrapper, contain perfumes and even dyes. Rayon is a highly absorbent fibre which rapidly absorbs menstrual blood but at the same time can also dry out the natural protective mucous lining of the vagina. No-one should be exposed to pesticide residues, phthalates, azo-dyes and dioxins, especially in such a sensitive and absorptive part of the body. Know exactly what you put in your body.", "reviews": ["I’ve been trying out various natural tampons, and so far this is the one that works the best for me. Absorbency seems the same for all the tampons I’ve tried, regardless of brand (and I typically use regulars through super pluses depending on the flow), but something about other tampons, even the natural ones, causes irritation (I have very sensitive skin and a lot of allergies), but not these. I also prefer the ones without an applicator (because you can carry them around much more discreetly, not to mention reducing all that excess waste).", "Easy and effective", "I believe that things have come a long way with regards to feminine hygiene products and now you can purchase certified organic feminine products and why would you use anything else? If you eat organic foods, but then you are ok will using products in/near the most private area of your body that is made with commercially grown cotton grown with pesticides (in the top for pesticide use)? There is no excuse anymore! Stop spending money on other things that are not going to do anything to improve or further your health in any way and then say you can't afford to buy organic feminine hygiene products. If you still have doubts then read up more on the website for this company as they give you a lot of great information. Please share this with all the women in your life - family, friends, neighbors, colleagues, etc.\n\nI checked out the website for the organic trade association and here is info from the site on cotton (you can go to the site yourself to read more). Here are some reasons why organic cotton production is important to the long-term health of the planet.\n\nCotton is considered the world's 'dirtiest' crop due to its heavy use of insecticides, the most hazardous pesticide to human and animal health. Cotton covers 2.5% of the world's cultivated land yet uses 16% of the world's insecticides, more than any other single major crop.\n\nAldicarb, parathion, and methamidopho, three of the most acutely hazardous insecticides to human health as determined by the World Health Organization, rank in the top ten most commonly used in cotton production. All but one of the remaining seven most commonly used are classified as moderately to highly hazardous. Aldicarb, cotton's second best selling insecticide and most acutely poisonous to humans, can kill a man with just one drop absorbed through the skin, yet it is still used in 25 countries and the US, where 16 states have reported it in their groundwater.\n\nCotton uses approximately 25% of the world's insecticides and more than 10% of the pesticides (including herbicides, insecticides, and defoliants.). (Allan Woodburn)\n\nApproximately 10% of all pesticides sold for use in U. S. agriculture were applied to cotton in 1997, the most recent year for which such data is publicly available. (ACPA)\n\nFifty-five million pounds of pesticides were sprayed on the 12.8 million acres of conventional cotton grown in the U.S. in 2003 (4.3 pounds/ acre), ranking cotton third behind corn and soybeans in total amount of pesticides sprayed. (USDA)\n\nOver 2.03 billion pounds of synthetic fertilizers were applied to conventional cotton in 2000 (142 pounds/acre), making cotton the fourth most heavily fertilized crop behind corn, winter wheat, and soybeans. (USDA)\n\nThe Environmental Protection Agency considers seven of the top 15 pesticides used on cotton in 2000 in the United States as \"possible,\" \"likely,\" \"probable,\" or \"known\" human carcinogens (acephate, dichloropropene, diuron, fluometuron, pendimethalin, tribufos, and trifluralin). (EPA)\n\nIn 1999, a work crew re-entered a cotton field about five hours after it was treated with tribufos and sodium chlorate (re-entry should have been prohibited for 24 hours). Seven workers subsequently sought medical treatment and five have had ongoing health problems.\n\nThis ought to open your mind to research more about the products you use!\nBe proactive and take control of your life and your health!", "I believe that things have come a long way with regards to feminine hygiene products and now you can purchase certified organic feminine products and why would you use anything else? If you eat organic foods, but then you are ok will using products in/near the most private area of your body that is made with commercially grown cotton grown with pesticides (in the top for pesticide use)? There is no excuse anymore! Stop spending money on other things that are not going to do anything to improve or further your health in any way and then say you can't afford to buy organic feminine hygiene products. If you still have doubts then read up more on the website for this company as they give you a lot of great information. Share this with all the women you know - family, friends, neighbors, colleagues, etc.\n\nI checked out the website for the organic trade association and here is info from the site on cotton (you can go to the site yourself to read more). Here are some reasons why organic cotton production is important to the long-term health of the planet.\n\nCotton is considered the world's 'dirtiest' crop due to its heavy use of insecticides, the most hazardous pesticide to human and animal health. Cotton covers 2.5% of the world's cultivated land yet uses 16% of the world's insecticides, more than any other single major crop.\n\nAldicarb, parathion, and methamidopho, three of the most acutely hazardous insecticides to human health as determined by the World Health Organization, rank in the top ten most commonly used in cotton production. All but one of the remaining seven most commonly used are classified as moderately to highly hazardous. Aldicarb, cotton's second best selling insecticide and most acutely poisonous to humans, can kill a man with just one drop absorbed through the skin, yet it is still used in 25 countries and the US, where 16 states have reported it in their groundwater.\n\nCotton uses approximately 25% of the world's insecticides and more than 10% of the pesticides (including herbicides, insecticides, and defoliants.). (Allan Woodburn)\n\nApproximately 10% of all pesticides sold for use in U. S. agriculture were applied to cotton in 1997, the most recent year for which such data is publicly available. (ACPA)\n\nFifty-five million pounds of pesticides were sprayed on the 12.8 million acres of conventional cotton grown in the U.S. in 2003 (4.3 pounds/ acre), ranking cotton third behind corn and soybeans in total amount of pesticides sprayed. (USDA)\n\nOver 2.03 billion pounds of synthetic fertilizers were applied to conventional cotton in 2000 (142 pounds/acre), making cotton the fourth most heavily fertilized crop behind corn, winter wheat, and soybeans. (USDA)\n\nThe Environmental Protection Agency considers seven of the top 15 pesticides used on cotton in 2000 in the United States as \"possible,\" \"likely,\" \"probable,\" or \"known\" human carcinogens (acephate, dichloropropene, diuron, fluometuron, pendimethalin, tribufos, and trifluralin). (EPA)\n\nIn 1999, a work crew re-entered a cotton field about five hours after it was treated with tribufos and sodium chlorate (re-entry should have been prohibited for 24 hours). Seven workers subsequently sought medical treatment and five have had ongoing health problems.\n\nThis ought to open your mind to research more about the products you use!\nBe proactive and take control of your life and your health!", "Great product!", "I keep accidentally buying these instead of the ones by the same company that do not have applicators. These are the shape of old school tampex tampons where as the non applicator ones are shaped like OB’s . These do the job and are high quality but the ones without the applicators are more discrete (for sex, etc.) and comfortable.", "I was a little disturbed that they didn’t come with an applicator. You have to stick it up there if you catch my drift.. gets messy but I didn’t cramp as bad with these as I would with non organic.", "I used OB tampons for years in an attempt to reduce the amount of waste produced by my tampon habit. After you get used to the lack of an applicator, it's really no big deal. Then, after considering the health implications of putting synthetic materials and chemically treated cotton into my body, I made the switch to organic tampons about 10 years ago. Not only would I rather have organic cotton in by body than synthetics for obvious reasons of preferring natural materials, but I've also read that they pose less risk of Toxic Shock Syndrome. I've tried a number of brands, but have found NatraCare to be my favorite for their ease of use, price, and ready availability on Amazon.\n\nOne of my favorite things about these is that they are constructed well. As they absorb fluid, they unfold in a flower sort of shape that catches everything very efficiently. I can count on them to work, no matter what I'm doing. The tiny little individually wrapped tampons are also super discreet, and can fit into any little pocket without causing a scene. I've been using these for nearly 3 years, and will continue to buy!", "These are my favorite. They have such thick nice cotton that you can adjust/loosen with your fingertips. I like that they’re small and discrete and don’t make extra trash with an applicator.", "I thought they would come with applicators but its just the cotton tampon. I ordered regular and was sent super. They do not have a return policy so I threw them out. For me they were very hard to use and I was disappointed about being sent the wrong size. These may be good for those who do not want to use the applicator but I wanted an applicator!", "We bought these for my S/O. There is NO applicator, I read the applicator is cardboard but.. where is it?? How are you supposed to insert it? Not to mention the fuzz that comes off the tampon just from pulling out the string. So 1. You can’t even insert it and 2. If you somehow manage to, you’re going to have fibers left over inside that will be prone to infection. Don’t waste your money. I’ve tried adding photos but they aren’t uploading for whatever reason but seriously just take my word and do not buy these, at least not from this seller. A refund has been issued.", "It gets the job done lol & it's organic cotton with no applicator\nMy favorite", "So I have been using this product for almost a year and have loved it! Until this past cycle..\nGranted that it was a much lighter cycle than normal. When I went to change it, i was taking it out when I noticed that the tampon pulled apart a little. It didn't rip in half but part of the cotton tampon did stay inside.. I was able to get it all out and nothing bad happened.\nRegardless, I am a little more wary of it now using anything over the \"normal\".\nI will still use the product. It's one of the better organic tampons that I have used!", "It's really important for me to use an organic tampon even more so than an organic maxi pad because it's such an intimate product. I knew a girl in high school (the '80's) who got TSS. I started using organic tampons about 5 years ago. I was lucky all those years using mainstream brands. Please Google \"TSS Woman Loses Leg\" and you will understand why I insist on using an organic tampon. These Natracare tampons are much like O.B.'s but they are made with organic cotton. In terms of price, they are not much different in cost than O.B.'s and most other mainstream brands. If you care about using this kind of product, Natracare is a good choice. I know some women prefer to use tampons with an applicator. I've never tried the Natracare brand but they do make those too.", "Product itself seems fine, but it made me really uncomfortable that all three boxes came already opened and then secured with packing tape from some third party. To be honest it made me wonder if this was an authentic item or if it was someone trying to replicate. Would be curious if others had this experience?", "Not what I expected. I'm ok with the non applicator but it's hard to get the wrapper off, the cotton can come loose when trying to grab the string and the string is so flimsy, I worried I might not be able to get it out at some point.", "easy to put in and feels good; notice that my period cycles are shorter and lighter when using 100% cotton period products", "These do not have the push insert they are just plain. I prefer the ones with the paper inserts. Have used this brand for years and like them bc of no bleach etc in them. I just ordered the wrong box.", "The wrappers are hard to open, and the cotton falls apart by the string as you attempt to untangle the string from the bottom to be able to insert it. The absorbency does not compare to other brands in the same category. I will not purchase again.", "These work really good. Obviously, the no applicator is a bit messy at times, but the other organic cardboard applicators are so tricky to get right all the time. This product eliminates that issue. They are still organic cotton, which is my main requirement. They are comfy, don't leak, inconspicuous, and I would buy them again (if they're prime)."]}, {"link": "https://www.amazon.com/dp/B000056VHC", "title": "Pepcid Complete Acid Reducer + Antacid Chewable Tablets, Heartburn Relief, Mint, 50 ct", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/71mUoNxR58L._AC_SX569_.jpg", "ratings": "5,566 ratings", "description": "Quickly relieve heartburn associated with acid indigestion and sour stomach with Pepcid Complete Acid Reducer + Antacid Chewable Tablets. These cool mint-flavored heartburn relief tablets combine a fast-working antacid and long-lasting acid reducer to help control acid all day or all night.* Formulated with 10 mg of the acid reducer famotidine, 800 mg of the antacid calcium carbonate and 165 mg of the antacid magnesium hydroxide per tablet, this heartburn reliever helps to neutralize and control acid. The dual-action formula starts working in seconds and lasts longer than Tums.** Whether at brunch or a new food spot, use Pepcid Complete Mint Chewables for fast-acting relief so you don't have to worry about hurting now or hurting later. * Based on 9-hour acid control studies during the day and 12-hour acid control studies during the night. Acid control does not imply symptom relief. ** Tums is a registered trademark of GlaxoSmithKline.", "reviews": ["Nice size bottle for Cost plus it's mint flavor which you can't hardly find here where I am", "It works", "I tend to get heart burn when I go to bed and chewing a Pepcid stops it immediately.", "I use this product for heartburn associated with acid reflux. Even though a little pricey it works quickly and I prefer the mint flavor.", "This helps with stomach acid and acid reflux.", "All is good .", "I have a history of stomach ulcer that I have managed by drinking raw apple cider vinegar and kombucha. When I am going through a high stress time when I don't have control of my diet, these chewable tablets are life savers. I only need to take one and find no need to pop them like candy. If you have to take meds, this is a mild solution that won't leave a bad taste in your mouth. I buy it from Amazon because Costco, CVS, Walgreens are constantly out of this flavor.", "Most effective product I have used.", "Best way I know of to stop acid reflux for a whole day. Pleasant flavor too. Quite expensive though.", "I get reflux in middle of the night. I keep a bottle by the bed and chew on one and in a minute I feel relief. Great product!!", "Used to calm acid reflux", "This is a product we order monthly and use for acid reflux. It works well and was recommended by our doctor.", "Excellent taste, stops burning sensation immediately.", "I like the tropical flavor the best..not real strong in taste. 👍", "Half the time I can’t find in local stores so subscription works great for me", "Pepcid Complete works really well for calming upset stomachs. The minty taste is great, but it is not too overpowering. These are a great value as well-I highly recommend them!", "Works faster and lasts longer than other antacids", "We have some stomach issues and doctors prescribed us Famotidine, this was the best choice for OTC. Great taste.", "This is usually the best price for Pepcid. Works for chest and stomach acid!", "this product works better than any other acid reducer that i have found. I bit pricey but I will take quality over quantity all day long."]}, {"link": "https://www.amazon.com/dp/B00006ANDK", "title": "Oral-B Sensitive Gum Care Electric Toothbrush Replacement Brush Heads Refill, 3 Count", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/71t5tJpTCXL._SX425_.jpg", "ratings": "17,571 ratings", "description": "The Oral-B Sensitive Gum Care replacement toothbrush head features extra soft bristles for a superior* gentle clean, ideal for cleaning around sensitive and inflamed areas. The round brush head is inspired by dental professional tools for a tooth-by-tooth clean, with specially engineered bristles for optimal tooth coverage. Compatible with Oral-B Genius 8000, Oral-B PRO 7000, 6000, 5000, 3000 and 1000, and Oral-B Vitality. Each order comes with 3 Oral-B Sensitive Gum Care Electric Replacement Toothbrush Heads. *vs. a regular manual toothbrush", "reviews": ["These could last long past three months if you don’t have the money for new heads. I still change them. They’re great for deep cleaning. Okay value for money; I find them a bit expensive.", "This is a great bush for the money with interchangeable brush heads. I prefer the sensitive one. Nice blue color. The reason I gave it a 4 star is that it becomes slippery when using - the one I had before had a rubberized area where you would hold it to brush teeth.", "With gum problems this is ideal.", "Great product and price", "I purchased these brush heads because my dentist recommended SOFT bristles, so as not to abrade the enamel, and these are highly effective. The next firmer version is Pro Gum, which I haven't tried, while the firmest is CrossAction. (Oral-B: Why do we need three head options?) These Sensitive Gum Care work just fine.", "Cleaning my teeth!", "A+++ seller! Quick to ship! Thanks!", "Gets the job done!!!", "I personally feel like OralB charges too much for their replacement heads. Price aside, these are soft. You do not have to press down hard to be effective. Overall they are much better quality than the generic alternative.", "Does a nice job cleaning my teeth well. One head lasts about 3-4 months.", "These brushes have made such a difference in my oral health. Makes me WANT to brush knowing I won't hurt my gums.", "Price is too high. Brush does a good job", "I did not know there are at least 5 varieties of oral-b brush heads. My prior attempt hurt my mouth to the point of unusable. These are great. Perhaps they don't clean quite as thoroughly (and I don't know that), but a toothbrush you can use is always better than one you cant.", "Good quality brush for sensitive teeth. Recommended", "Amazon is the only place I can find these replacement toothbrush heads. My dentist asks me to use the softest toothbrush and this is it!", "My child wanted an electric toothbrush like Mommy and DAddy, so I bought the same kind we had and use this sensitive head on it. It's a good size for a child's mouth and keeps their teeth clean, so we will keep using this. I've used Oral B for years and it's been a solid brand toothbrush and replacement head product. Will continue to buy.", "I made a huge mistake of trying to save a few bucks by buying an offbrand toothbrush end that was compatible with my Oral-B electric toothbrush and ended up getting gum damage before I could even finish the pack. I discovered these and ordered them right away. In a month and a half’s time, my gum gum damage has healed. I was concerned that my teeth would not feel clean using these, but that has not been the case. My teeth feel just as clean, but I no longer have to worry about my gums.\n\nI will never buy any other toothbrush end again! Thank you Oral-B!!!", "Arrived in a timely manner. Makes it possible to maintain my teeth and replace these heads whenever I need to.", "These are wonderful and hard to find, I couldn't find them in stores near me.", "I bought a knock-off brand of brush heads and the bristles were far too stiff for my gums. Really uncomfortable. These feel great and do a wonderful job. My hygienist was very pleased at my most recent visit."]}, {"link": "https://www.amazon.com/dp/B00007JQP2", "title": "Pacific Blue Basic Multifold Paper Towels (Previously Branded Acclaim) by GP PRO (Georgia-Pacific), White, 20204, 250 Towels Per Pack, 16 Packs Per Case, (Case of 16 Packs, 250 per Pack)", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/41KNOYoPvjL._SY445_SX342_QL70_FMwebp_.jpg", "ratings": "3,487 ratings", "description": "Universal Folded Paper Towels are an essential supply for a wide range of professional, away-from-home facilities. They come in white and brown colors, with recycled content options available, and different fold configurations, including C-Fold, Z-Fold, M-Fold and S-Fold. They are typically dispensed from ‘universal folded towel’ dispensers that are mounted on the wall and available from towel manufacturers. In smaller business environments and restrooms, folded towels are sometimes ‘set out’ in an open tray or simply stacked on the side of a sink or work space. GP PRO is a division of Georgia-Pacific Consumer Products. We deliver well-designed, durable and easy-to-maintain professional solutions to meet the handwashing and cleaning needs for a range of business applications.", "reviews": ["This is what I use for my business since day one.\nIt's absorbent and great for clean up.\nCan't beat the price with it's quality.", "Great for my small business So much cheaper than those rules", "I recently started using these types of towels in my kitchen as a replacement for my paper towel rolls, figuring might be a better value so we can use paper towels to dry our hands instead of hand towels, thereby reducing cross contamination of germs and maintaining a little more clean environment in the house. I tried these hoping they would be an economical version - while they are less expensive, I find that because they are thin and hard and not so absorbant, that I am using 3x the number of towels as normal. I really did not like these towels and felt I would rather pay a little more and get a better quality towel... Sorry, but that's how I feel in regards to using these BASIC towels for home use as a replacement for paper towels. BUT that being said....... if these are to be used for the workshop to clean stuff, or somewhere else like a shop bathroom, they may be a perfect and economical towel. So to summarize....... in my opinion, if you want these as a replacement for paper towels/home use, don't get this particular version, you will probably be disappointed like I was (which is why I gave it so few stars) But if you want them for some other use, they might be great. You have to decide based on your needs whether these will work for your purposes or not.", "GREAT PRICE & Great value", "Cheap, much thinner, much less value. Poor quality. The only good thing was the fit in the holder better.", "I like this product. It's just what they said in the write up. When we pull out of the dispenser, they pull out linked like they should. I\"ll buy again.", "These papers towels are terrible! I always buy white three ply paper towels and these are the worst! Unless I got a defective batch!", "I ordered this case of paper towels around mid-March 2020 when paper towel rolls started to disappear online and at brick & mortar stores. Realizing that I was running out of options fast, I turned to shopping for these bulk paper towels as a still reasonably priced alternative.\n\nI was expecting 2 ply paper towels but soon realized that they were only 1 ply when I inspected the product upon delivery. Nevertheless, this product served its purpose as replacements for paper towels rolls and disposable table napkins.\n\nIt's now close to the end of June 2020 and we still have a lot of these paper towels left. I packed the bundles separately in plastic wrap to protect them from moisture, contamination & pests. This also made it easier to store the paper towel bundles in our kitchen cabinets, instead of leaving them inside the box that they were shipped in.", "These remind me of the paper hand towels you find in common bathroom at a small office. Great if you go through a lot of hand towels. Absorbancy - well they suck water up fast but are super thin when they do. Idea for drying hands not wiping up spills or using as napkins outdoor in the summer bbq time.", "I bought these because all the stores are out of paper towels. These are like the old fashioned ones you used to get out of paper towel dispensers except they are white. They are single-ply so not too thick, and not as absorbent as Bounty, but they do the trick.\n\nI was able to clean all surfaces in my home and did the windows, too. You get 16 packets of paper towels so these will last a long time. Each piece is 9 inches x 9 inches, so a bit smaller than my regular paper towels, but they work fine.\n\nMy order came in 5 days during the midst of the shortages. Would highly recommend.", "I ordered this for my clinic/shop, and unfortunately, my staff did not like the lack of strength. They reported to me that the paper towels did not hold up as well as they need, and would rip or break up faster than what they were accustomed to when we were ordering a pricier paper towel brand. So, I switched to another brand that is slightly more resistant to tearing and falling apart. However, let me say this: I used these paper towels on occasion and found them to be a nice texture, albeit slightly thin. If you don't need heavy duty paper towels, these might work for you. It just didn't work for our needs because we perform clinical services and the paper towels weren't strong enough under those circumstances. Perhaps they might work better for home use, though.", "They are soft, absorbent and a value for the money.", "I normally use Viva or Brawny but during these times found it not economical. The paper towels are very useful and sturdy. Its your normal commercial type paper towel. It is not Super absorbent, however it will absorb small amounts at a time. I use it in the bathroom in lieu of hand towels and I use it in the kitchen.\n\nIt has proved to be very economical. Use it to clean counters or pick up messes on the floor. It doesn't tear apart.\nOverall great product.", "These are great if you are looking for a large bulk of paper towel-napkins. Each lot is wrapped in brown paper until you want to use them. They aren't the best absorbers, as they are thin and papery. Yet, for a quick hand dry or such, they do the trick.", "Not as soft as I would like but during the times of Covid and the lack of paper products, I ordered these. They’re a good value and couldn’t go wrong with trying them. Plus it came right to my door! Thanks Amazon!", "These are, I am quite sure, made from recycled paper. There is nothing wrong with that. I use regular paper towels very often, for various cleanup tasks. These multi fold paper towels are used for drying my hand# for whatever reason, and for quick cleanups of certain liquids. They are perfect for that. I find myself now using them for more things. Sure use a lot less, off the more expensive , paper towels this way.", "I have these sitting in my bathroom, my kitchen and anywhere there is a sink to wash hands or dry up spills. During the pandemic these are essential to me! I have spread the word more people need to be using these at home not just at the office. They are reasonably priced and a quality product.", "Bought these because no store had paper towels and we just got two puppies that were having accidents. These paper towels are industrial style paper towels that you see at work or businesses. They don’t really absorb much and are not the softest but I knew this before I bought them. If you are buying them for your business or just to dry hands like you’re supposed to, then they are perfect but if you need them to wipe things up, I would look elsewhere.", "put the towels in a plastic container that has a tight lid. Use 70 percent alcohol, a few drops of dish soap, and enough water to cover the towels. Ratio I use is 3 parts alcohol to 1 part water.", "These are fine to clean up a spill, but I prefer a towel that is more absorbent and has a less papery feel. I would say these are slightly better than the brown paper hand towels you would find in a gas station rest room."]}, {"link": "https://www.amazon.com/dp/B00015QE18", "title": "Kama Sutra Aromatics Massage Oil Sweet Almond, 8 Fl Oz", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/51xLyzWmusL._AC_SX569_.jpg", "ratings": "1,081 ratings", "description": "Sensual Intimacy Aromatic Blend Massage Oil Sweet Almond 8oz", "reviews": ["What more can I say about this other then We love it. If you want to spice up your relationship through sensual massage we highly recommend this product. It goes on great and is extremely slippery. The scent is incredible and I like the taste for those moments when you feel the need for more then touching 😈", "We've used it for years. Just the aroma does it for me. It has gone up in price but well worth it.", "I love the scent and feel of this oil. I have bought multiple times.", "Have used for several years and like the product.", "I love this oil!\nSoft skin delightful smell.\nAlluring scent. ☺️", "For a long time, Kama Sutra personal products have been a benchmark in the market. I am almost always satisfied with their quality and value. However, for some reason this massage oil fell a little flat. True, it's got a lovely scent and is silky smooth, but it didn't seem to absorb like some other oils I've tried lately, just sat on the skin. Nevertheless it will find a use, but isn't my first choice for theraputic massage oil.", "Good massage oil. I like the scent quite a bit - very floral and pretty strong, so keep that in mind if you like subtle scents, but I enjoy it. Rubs in nicely, good consistency, keeps the skin well-lubricated for continued massaging. I use a lot of massage oil though, so your mileage may vary as far as it's \"staying power,\" but I enjoy using it. My wife seems to like it too, which is kind of the point. I'd definitely buy it again.\n\nRecommendation to you guys out there - buy this massage oil and this book: http://www.amazon.com/Kama-Sutra-Of-Erotic-Massage/dp/0939263246\n\nThe sequence of massages is kind of long but spend a few days getting a general idea of the flow before actually putting it into practice. You don't even need to do the genital stuff. Light some candles, play some nice music (spa, jazz, whatever), grab the massage oil - your wife will love you.\n\nSorry for the double review, consider me inspired by recent memories of using this massage oil.", "Massage oil arrived as expected. Good, sanitary packaging made us confident in the quality of the product. Texture is great. It is oil based obviously so I'd recommend putting down a towel or other protective cover before applying so as not to ruin blankets/sheets or upholstery. Does not get tacky and rubs in easily. My wife does wish the scent was a bit stronger but otherwise the scent is very pleasant and we enjoy using it.", "Same as above", "The chair cover was better than I expected!!!", "I love this oil and I have been buying it for years. The scent is very nice and mild. It is not overpowering. I use it on my legs to moisturize especially when I wear shorts. It's good for dry skin. It's nice to use for a back rub too!", "The sweet almond SCENT and FEEL is luxurious ! Glides on so smooth and has a light sweet almond essence. Been using it for years. Cannot live without it!", "This is a perfect massage oil. Soft calming scent that leaves skin feeling great. Highly recommend this product. This one is worth a perfect 10 in my scorebook.", "Nice easy scent. Great for massage.", "It's lubricant, and works as it should. However, I didn't think it was as enticing as advertised. I think it was used once or twice before we pretty much lost/left/and or forgot about it. I'm 100% sure there are better options out there. Not saying that it won't do it for others, or that it wasn't worth the money, it just didn't do much more than some cheap ol' KY would do.", "Love this product. A little goes a long way.", "Great feeling massage oil and i totally love the smell.", "The wife loves it... that's all that matters. Perfect for a massage!", "So excited that this smells just as I remembered from years ago. I actually love the smell to wear it as a perfume scent! 😁", "Best smelling oil ever!"]}, {"link": "https://www.amazon.com/dp/B00015QE18", "title": "Kama Sutra Aromatics Massage Oil Sweet Almond, 8 Fl Oz", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/51xLyzWmusL._AC_SX569_.jpg", "ratings": "1,081 ratings", "description": "Sensual Intimacy Aromatic Blend Massage Oil Sweet Almond 8oz", "reviews": ["What more can I say about this other then We love it. If you want to spice up your relationship through sensual massage we highly recommend this product. It goes on great and is extremely slippery. The scent is incredible and I like the taste for those moments when you feel the need for more then touching 😈", "We've used it for years. Just the aroma does it for me. It has gone up in price but well worth it.", "I love the scent and feel of this oil. I have bought multiple times.", "Have used for several years and like the product.", "I love this oil!\nSoft skin delightful smell.\nAlluring scent. ☺️", "For a long time, Kama Sutra personal products have been a benchmark in the market. I am almost always satisfied with their quality and value. However, for some reason this massage oil fell a little flat. True, it's got a lovely scent and is silky smooth, but it didn't seem to absorb like some other oils I've tried lately, just sat on the skin. Nevertheless it will find a use, but isn't my first choice for theraputic massage oil.", "Good massage oil. I like the scent quite a bit - very floral and pretty strong, so keep that in mind if you like subtle scents, but I enjoy it. Rubs in nicely, good consistency, keeps the skin well-lubricated for continued massaging. I use a lot of massage oil though, so your mileage may vary as far as it's \"staying power,\" but I enjoy using it. My wife seems to like it too, which is kind of the point. I'd definitely buy it again.\n\nRecommendation to you guys out there - buy this massage oil and this book: http://www.amazon.com/Kama-Sutra-Of-Erotic-Massage/dp/0939263246\n\nThe sequence of massages is kind of long but spend a few days getting a general idea of the flow before actually putting it into practice. You don't even need to do the genital stuff. Light some candles, play some nice music (spa, jazz, whatever), grab the massage oil - your wife will love you.\n\nSorry for the double review, consider me inspired by recent memories of using this massage oil.", "Massage oil arrived as expected. Good, sanitary packaging made us confident in the quality of the product. Texture is great. It is oil based obviously so I'd recommend putting down a towel or other protective cover before applying so as not to ruin blankets/sheets or upholstery. Does not get tacky and rubs in easily. My wife does wish the scent was a bit stronger but otherwise the scent is very pleasant and we enjoy using it.", "Same as above", "The chair cover was better than I expected!!!", "I love this oil and I have been buying it for years. The scent is very nice and mild. It is not overpowering. I use it on my legs to moisturize especially when I wear shorts. It's good for dry skin. It's nice to use for a back rub too!", "The sweet almond SCENT and FEEL is luxurious ! Glides on so smooth and has a light sweet almond essence. Been using it for years. Cannot live without it!", "This is a perfect massage oil. Soft calming scent that leaves skin feeling great. Highly recommend this product. This one is worth a perfect 10 in my scorebook.", "Nice easy scent. Great for massage.", "It's lubricant, and works as it should. However, I didn't think it was as enticing as advertised. I think it was used once or twice before we pretty much lost/left/and or forgot about it. I'm 100% sure there are better options out there. Not saying that it won't do it for others, or that it wasn't worth the money, it just didn't do much more than some cheap ol' KY would do.", "Love this product. A little goes a long way.", "Great feeling massage oil and i totally love the smell.", "The wife loves it... that's all that matters. Perfect for a massage!", "So excited that this smells just as I remembered from years ago. I actually love the smell to wear it as a perfume scent! 😁", "Best smelling oil ever!"]}, {"link": "https://www.amazon.com/dp/b00015xaq0", "title": "Avalon Organics Cleansing Gel, Intense Defense with Vitamin C, 8.5 Oz", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/61MkgKeRPUL._SX425_.jpg", "ratings": "3,690 ratings", "description": "Avalon Organics Intense Defense Cleansing Gel, 8.5 Fluid Ounce. Intense Defense with Vitamin C, for environmental stress and damage. This Cleansing Gel refreshes skin with pure botanical cleansers that lather away toxins and impurities. Oxidative stress can cause free radical damage to skin resulting in collagen and elastin deterioration, wrinkles, hyperpigmentation, freckles and sunspots. What causes this stress? Studies show that environmental factors, such as pollution, extreme temperatures, wind burn and even minimal exposure to UV light, can trigger damage to skin cells. The Intense Defense skincare line features a powerful medley of Vitamin C, Lemon Bioflavonoids and White Tea, all potent antioxidants proven to neutralize free radicals before they can cause damage, while naturally boosting collagen and elastin production. Over time, through skin's natural renewal cycle, damaged skin cells will be eliminated while antioxidants help prevent further damage to new cells. Skin can regain its youthful glow and continue to fight the signs of aging. Avalon Organics is grounded in the knowledge that all beauty begins within the Earth. Guided by the wisdom of nature, each product is thoughtfully crafted for optimal effectiveness while meeting a strict organic standard. Formulas contain carefully selected botanicals that are nurtured by the elements then tenderly harvested to nourish the body from the outside in. Deep rooted beauty is at the heart of the Avalon Organics Guiding Principles - ensuring that every product reflects a deep reverence for the planet and all it provides and contributes in its own small way to a holistic lifestyle of health, wellness and sustainability.", "reviews": ["I really like this gel! My face is partly oily and partly dry. This balances the look and feel of my skin very well and in a lasting way. If I use it in the shower in the morning, my skin still feels good late into the evening. I had little subsurface white bumps under my eyes and this gel has eliminated them over time. I am in my seventies and anyone I meet who has a reason to know my age is surprised I am not in my fifties! Part of that is genetics, but a good share of that is the condition of my skin. Even my dermatologist is impressed!", "I like the ingredients. They are better than a lot of supposedly \"natural\" face washes out there. I love the way the gel feels as you rub it on your wet face. It doesn't lather WHICH IS GOOD, people! It doesn't have to lather to work well! It feels very hydrating as you wash, and the smell is predominently a fresh aloe vera smell for those who have had a real aloe vera plant and used it (aside from the very light citrus undertones which dissipate quickly and are not strong because they aren't synthetic perfumes) . It does feel a little drying once your face is dry but definitely clean, and nothing a little serum or moisterizer corrects. I am 30, have never had an issue wih breakouts mainly because I let my face rest: I don't wash it every day, I don't put a ton of products on it every day. I go bare-faced as much as possible and let my pores stay unsuffocated. As a result, my face stays clear and wrinkle free so far. I use this cleanser maybe twice a week, no more, and only to cut the grime and any sweat that settles on my face after general living. But for me, this cleanser fits the bill and feels wonderful.", "I really like this organic face cleanser. It smells wonderful and my face feels cleaner and softer afterwards. My only complaint is that it comes in a plastic bottle and I don't know where I could refill it.", "I have been using this product for years but have been having difficulty finding it. I am so glad that Amazon carries it, and I got on the replenishment program, now a new bottle shows up right as I am running out of one. Thank you for taking the hassle of having to run around to different stores out of my face care routine. I have tried many face washes, some don't leave your face feeling fresh, or they leave a sticky film. This wash is perfect. I can't tell if it is brightening my face, I just like how it leaves my skin feeling, clean.", "This stuff is great for my oily skin but doesn’t seem over drying where my face is completely dried up with alcohol or something. It’s a slippery gel type of consistency and it melts off my foundation. It smells like straight-up, real, fresh orange peels. I’ll lather and leave it on my face in the shower after my pores have opened up a bit and it will start tingling and slightly stinging but not in a bad way .. as if I can feel it settling into my pores to deep clean. I’ll rinse with cooler water and my face looks brighter and a bit smoother too as if it eats a little bit of dead skin off of your face. I have very oily acne prone skin.", "I like this cleanser - it does a good job of cleaning without stripping my face dry. My skin can be sensitive, but i have never had a reaction to this. The gel consistency keeps it on my silicone scrubby pads without falling off into the shower , and it foams up just enough - dense but not extravagant and hard to rinse off.", "I’ve been using this product for about 3 years now. The store I used to buy it from stopped carrying it, so I decided to start buying online. I love this for my combination oily skin. I can see the difference after using it and how my skin looks brighter after use. And it doesn’t feel either oily or dry after use. Skin just feels clean. I have significantly less breakouts now. And, I’m convinced the vitamin c is keeping my skin looking young as people always seem to think I look about 10 years younger than I am. This is especially important to me, because I haven’t always had nice skin. I recommend this to others. I tried the cream based one in the same colored bottle, but didn’t care for it as I felt it left a greasy residue on my skin. Make sure to get this gel and not the cream.", "I really like this product. I have used it for over a year. I can't say anything about the price it used to be a year ago, but look around the interwebs.", "Out of nowhere my face has become sensitive to everything and seems like all products lead to breakouts. I kept trying so many different cleansers that I finally decided to try soaps I previously used when I was younger with acne. This is a pretty reliable soap for me. Prevents pimples and feels like I get a good clean. It's a tiny drying though, but I have found that's pretty typical with vitamin c cleansers or cleansers that prevent pimples. So I would rather have to moisturize than have pimples. The scent is nice. It's sweet smelling almost like a sweet cereal like fruit loops.", "I Love This Product and it is a powerhouse product. I purchased this product because I had a breakout on my face and my daughter gave it to me to continue my face healing from the breakout that I had. This product has works beautifully for me and I will continually using it and I have continually seen results on my skin. I am ecstatic with this product and what it has done for me and the smell is very pleasant and citrus. 2 Thumbs Up", "Have not been able to find this anywhere lately for a decent price let alone the toner . These are the only products i can use on my sensitive skin . Please make more amd lower the price !", "I have oily acne-prone skin even though I’m over 70. I’ve tried many face cleansing products and they were too perfume-y or left something on my skin. This cleanser is perfect. However when I bought it in March 2021 it was $9 for an 8oz bottle but now, July 2021, it’s over $27 for the same size. So it tripled in price! Unfortunately I had to switch products. If you can afford the current price then buy it because it’s a good product. I would have given it an overall five star rating except for the price.", "This, and the toner of the same product line, are probably the best facial products I have ever bought. I saw immediate results in lightened pigmentation (freckles, sun spots, left over pregnancy mask). My skin loves these products. The first time I used the toner, it felt and looked like it was burning my skin a bit so I took a wet washcloth and washed it off. However once the redness went away, my skin looked amazing! I realized that the toner is just really strong, so after that, I diluted it with water and saw less irritation, but still great results. The cleansing gel is much milder but still effective (I backed off the toner after the first time and was just using the gel alone for a few weeks). Since I now know that my skin handles the gel well, I typically scrub it into my face at the start of my shower and leave it there until I am ready for a final rinse. I follow up with the toner when I feel I need it. I have been getting so many compliments lately about how great my skin looks. I am hooked and especially love that it's mostly natural!", "I’ve been using this face wash for years. I love that it cleans my face at night without over-drying it, and I love the scent. I am really scent-sensitive, but the fresh orange smell of this is lovely. It removes most of my makeup, will leave behind just a tiny bit of eyeliner under my eyes that I can then wipe away with a tissue after I dry. I follow this cleanser with a Retinol serum and the Avalon Organics Intense Defense moisturizer. In the mornings I use the Avalon Organics Cleansing Milk.", "Love the product but when it came it was leaking out everywhere. Once I got it cleaned up and used it I enjoyed the invigorating citrus feel on my skin. Wish I got to have a full bottle!", "My face has the classic \"combination skin\" - oily in some places, dry in others. Moreover, it's facial skin on the body of a 50-something lady.\n\nI hate paying top dollar for small quantities of face care products. I also need products that require the least amount of my effort or time.\n\nI looked long and hard for a good facial cleanser that is reasonably priced. I navigated quite a few bad products along the way, several of which were not cheap. Very few facial cleansers left my face feeling \"Clean but not stripped\".\n\nThis product does this for me - my face feels clean, refreshed but not stripped or dry after. I pair this cleanser with a very light moisturizer and this combination works really well for me. One of these bottles lasts me quite a long time.\n\nIf I had a complaint, it would be that the bottle doesn't travel as well as I'd prefer. It's one of those that you have to turn the nozzle, pumping out the current contents of the pump, in order to lock it. And if you mess-up the first time, you get to pump out yet another squirt while you try to lock it (before packing it in your suitcase). This is the only reason I give this product 4 stars instead of 5.", "The scent, the texture, the way my face feels (moisturizes, not drying), the price - it all comes together in this product. It works!", "With my combination skin (some parts oily and some parts dry), I prefer a gel cleasner. I was originally introduced to Aveda's gel cleanser which is what got me started on that type. Recently I was using one from a company called Lemongrass Spa, but with it being a direct sales company it was a little pricier that I wanted. And no free shipping...and let's be honest, with Amazon Prime who wants to pay shipping anymore??? So I did a search and found this gel cleaner and decided to give it a try. So far it's working out well. I like this brand anyway, so I am happy to add more of their products to my lineup.", "After much research and considering price and ingredients I decided to order this for my severe perioral dermatitis. I am so happy with this that even though my skin has cleared up, I will continue purchasing this cleanser because it is that good! It never leaves my skin feeling irritated or stripped. The smell is nice and fresh and yes, it does a good job of removing makeup. This cleanser does foam (not like crazy) but it does foam enough to where you feel like “yes I’m clean!”. Highly recommend", "My face doesn't get nearly as red with this face wash as it does with others. It doesn't dry out my skin, and definitely helps brighten it up some. I've been using it for weeks now and I think I'll stick to this one. My skin loves it. I'm naturally prone to acne (hormonal and excess oils), have a good amount of redness at any given time & have somewhat sensitive skin. This feels so refreshing, like my skin can breathe finally without stripping off my whole dermal layer. Like I said, my face gets a bit red with this one but then totally balanced out after a minute. It's not totally moisturizing but it doesn't dry me out either."]}, {"link": "https://www.amazon.com/dp/B0001FSWMM", "title": "Optimum Nutrition Serious Mass Weight Gainer Protein Powder, Vitamin C, Zinc and Vitamin D for Immune Support, Chocolate, 6 Pound (Packaging May Vary)", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/61dIE57qUUL._AC_SX679_.jpg", "ratings": "62,843 ratings", "description": "Serious Mass is the ultimate in weight gain formulas. With 1,250 calories per serving and 50 grams of protein for muscle recovery support, this instantized powder makes the ideal post-workout and between meals shake for sizing up your goals. Serious Mass provides you with the tools you need to pack on the pounds and help you develop the physique you’ve always wanted. Calories per gram: Fat 9 Carbohydrate 4 Protein 4.", "reviews": ["I was just about making my second order and thought it would be nice to write a review.\nI'd never been a 'review person' and that's why even though i bought this product in 2014, i never had the time to review properly until now. I've decided to 'give back' too and not be so selfish thus, make it a habit from now. What better way to start off than with the products i've used and appreciated so much?\n\n*IF YOU DON'T WANT TO READ EVERYTHING, THIS'S JUST ABOUT MY CONCLUSION TO 1st TIME BUYERS OUT THERE* BASICALLY ;\n\n1. Be sure to workout intensely (esp. your tummy area) to prevent belly fat (cause trust me, it is real) like the plague\n2. If you find the mixture too sweet for your liking you could always dilute it with extra milk, some water, or anything other thing that works for you instead of complaining & whining about it and trying to force it down\n3. Mixing the chocolate & vanilla flavor (with milk) was something i wish i'd figured out sooner. I couldn't have asked for a better taste.\n4. If you're a hard gainer, you can be assured that this product WILL do something for you (if you take it properly and workout well it would do a whole lot more than that).\nI would know because i'm a serious hard gainer myself and wouldn't even say i 'used it that properly' at all but, in the end i did see noticeable gains and got weight gain compliments for the first time in all my life.\nI'm sure if you eat well, train really hard, and take this alongside you'd be just more than fine!\n5. It has some kind of \"very sweet after-taste\" though, which lasts for some time. (could be up to 12hrs or more) even if you keep eating things in-between or after you take this. What happens is soon as your mouth becomes empty for some time you start to \"feel the taste all over again\". I find it very annoying lol but it's the ONLY PROBLEM I HAVE with this product. I'm ok with any other thing.\n6. Remember to check with your doctor before taking this (if you have any health issues or are on medication or any other supplements).\n\nMy \"testimony\"...(if you're interested) ..\n\nI'd never gained above 5 lbs in such a short time my entire life! I weighed 42kg (92 lbs) before i started my weight gain journey in September 2014 and by the time my serious mass got finished (i visited a hospital in January 2015), checked my weight and it said \"50kg (110lbs)\"\nI'd never gone past 45kg my entire life! Even when i received those \"you've put on weight compliments\" when i was younger, highest i prolly was that time was like 43kg. Because of this i thought there was a mistake in the scales they were using at the hospital two year ago. because at that time i wasn't even taking the serious mass anymore cos it had finished about a month or so ago and i'd stopped working out for about a month or so as well.\nI actually asked the doctor \"um,are.. you really sure it's 50?..didn't it just say that because of my clothes or something?\" (and i'm someone who'd never asked a doctor \"are you sure\" ever in my life!) ... I mean i knew i gained some weight all right while i was still 'on track' with this, but then i knew i'd 'stopped my journey' and wasn't even doing anything anymore so i had definitely lost weight again. That's why i was so surprised! I mean, i had a mirror in my house and all ok?, but i guess because i was constantly looking at myself almost every hour on my gain journey i never actually realised that i had gained!\nIt really was 50kg. I had gained 7kg in 2 months!😇 (A HARD-GAINER) i want to stress on that again. LOL\n\nI found it really hard to believe so i had to check again during that week with a different scale (for some weird reason i didn't have a scale at home and always had to check outside of the house) lol i really wasn't serious. I checked and got the same measurement to my uttermost surprise. I didn't believe it (still) ... but then after some time i finally got over it & accepted it.\nThat was when it hit me... \"Oh, wow..does this mean i gained even more while i was still on the serious mass?\" ..\"umm.. Huh? \" And then it hit me again... \"this is the first time i've reached 110lbs! ...omg..*my eyes filled with tears* About a year ago that was actually my dream.. to get to 110lbs, and now i'm here! What is this?? How did this even happen?\"\nWell yeah, i WAS extremely confused for a long time. Trust me on that one.\n\nWELL ABOUT WORKOUTs;\n\nI used to do normal 'home exercises' and i never even went to the gym. I had a workout routine, but because i'm severely anaemic it was always extremely difficult for me to workout properly (and the way i REALLY wanted to). So i did basically some 'soft workouts'.\nI didn't have dumbbells at the time, so all i did was basically \"no dumbbell home exercises\" or \"workouts without weight\" more like it.\nThis is why i was so surprised i gained. I realised that if i'd used weights i would've gained even more. I did squats mainly, (different types of squats) and then some donkey kicks and tummy workouts usually. I normally followed \"fitnessblender\" videos on youtube, and then some other fitnessmodels' videos that i found.\n\n*****I bought 2 chocolates 1 vanilla the first time i ordered this product (yes, it was a huge risk i took but this is just how much i believed in this product even before i tried it for myself). I fell in love with it and knew right from the times i researched about it that it was the RIGHT one for me. That was what i needed tbh, and i just knew. I don't know how but oh well, it did pay off in the end so i guess i was just very lucky*****\n\nI never really experienced any form of 'super strength' or felt 'so strong' to do my workouts or anything whenever i used this DURING workout, (and i would not blame it on this because i already had serious low energy problems from my anemic condition), and plus it even says to use it mainly as \"between meals, post-workout & before bed\" in the description (which i did, but also used it as a pre- and during-workout shake as well) so um, because of that i'm not gonna say it didn't do much or help me with my workouts at all. I used it as a pre-and during workout shake mainly because it had creatine and i thought it would help me workout better and easier (But maybe i didn't experience that much of a change in strength/performance because the creatine content is really small? idk) but then i do know it helped me in all sorts of other ways nonetheless. I RECOVERED FROM MY WORKOUTS REALLY FAST and that was an incredible one.\n\nFOR THE TASTES;\n\nTHE CHOCOLATE; wasn't bad at all when mixed with milk.\nI used non-fat milk as they recommend, but then always added some extra cup or so of full cream milk after i got my serving (to dilute it a bit). This was good, i liked better the taste it gave me when i did that, but then the downside was that it increased the amount of the shake and so was always a bit harder to push down quickly.\n\nTHE VANILLA; wasn't bad either. I actually grew more fond of that after sometime when i'd taken the 2 chocolate bags for so long. I liked the taste of that too, but again, it was also way too sweet for my liking when mixed with milk (esp the after-taste). so i'd always add some extra full cream milk/a little water to it to dilute that a bit as well after i'd reached the serving size.\nAfter a while, i started mixing both flavors together and IT WAS GOOD! (i only had a few cups of the chocolate left when i figured this out, so i couldn't do that for long, but then with the few days i did that, i never regretted)!\nI would take one cup of the chocolate flavor, one cup of the vanilla flavor, blend them together, adjust a little with some extra milk, and i'm all good!\n(I always said to myself \"why didn't i think of this earlier?!\" lol)\n\nIn general i never tried any with just water but my brother did once and from the look of things, it's clear they both taste better with milk.\nI never tried mixing either with other solid stuff like peanut butter, oats & the like because i mostly used to blend them with other liquid nutrition shakes (and they always blended well) but i'll try mixing them with dry oats and some other solid stuff this time and see. I'll be sure to leave an update later!\n\nAnyway, to continue my \"testimony\";\n\nIn the beginning i couldn't eat any solid food the rest of the day after i took this in the morning. It filled me up more than a 3 square-meal ever would have so i was always worried i was going to end up relying on that and use that as my 'sole source of nutrition' the entire time.\nGood thing was.. after a while it SERIOUSLY 'OPENED UP MY STOMACH'' and i was able to eat more than i ever could have handled on my own usually. That made me very happy indeed\nI knew it was the work of the serious mass because that was by far the most caloric supplement i was taking.\n\nThe other products i took alongside (more for medical conditions & clinical purposes)were ;\nScandishake vanilla -580 calories\nEnshake chocolate- 600 calories\n(That was probably why i gained so much but i know the serious mass contributed greatly too!)\n\nOh and, ABOUT THE BLOATING THING PEOPLE SAY..\n\nWhat i'm gonna say is it is really true. And i realised it when i experienced it myself. (I already believed and was aware from what i'd read even before i bought the items, but i guess i just didn't think it would be that serious!) lol Yeah, the bloating is SERIOUS as well.\nI had read that you have to workout insanely if you didn't want to end up putting on ONLY FAT so i was already prepared for that. *Only i wasn't as prepared as i thought i was* lol\nBut then to be honest.. with all my 'daily ab workouts' and the like.. i still did have a big tummy while on this mass gainer! lol I probably didn't workout as hard but all i know is i gained weight in the places where i wanted to gain all right, only it came with a lot of belly fat too! I didn't even care at the time though, cause at the time i was far too happy with the gains and knew i could workout later to reduce the belly fat.\nIt was only funny because i'd always been a skinny girl, and i'd never seen my tummy so big (i was actually afraid at some point that it was going to stay that way and it would never go back to the way it was! lol).\n\nI mostly felt 'bloated' and i think it's because i wasn't used to having so much calories in my body. I felt so 'heavy' and 'so pregnant' all the time because i was always so full! lol it was a struggle. But i managed to pull through it. After some time of going off my weight gain journey i got my flat tummy back! :) I know what to do this time if i started my journey again so i doubt that would happen anymore! I will train harder than i did last time so i'm very well prepared i must say. So should you! 😊\nI would say it was fun though! The whole experience was fun and exciting as i'd never had that much CHALLENGE thrown at... well my body..ever! I was new to working out and all these mass gainers and the like. I gradually grew from there over time.. and now i know so much more than i didn't (two years ago) about mass gainers, workout routines and the like.\n\nI'm still attached to serious mass (yes of course, the love is still there!) and i would keep on buying until i've reached the goal i've always wanted to reach. (which is around 60kg or 132 lbs. I weigh 40kg now, that's about 88lbs yeah, unfortunately.. i lost all that weight in the course of just 1 year and i'm 21 now (which means very much underweight since i'm only 5'3) which is why i'm getting myself more bags of this product)!\n\nFunny thing's, i'm not even in the United States or Canada or the UK. I'm not in a country where i could easily get this product when and if i want. But then i still manage, and do all i can to get it every time (If i told you how much trouble i go through and how much money it costs me every time, you would marvel!)\nThe number of things i could buy with the amount i spend just trying to get 2 bags of serious mass down to where i am... it's ridiculous but oh well, when something's worth it you're never really bothered so this should tell you just how much useful this product is!\nThose of you who can just order it and get it the next day or two (and at this price with no other extra costs), be very lucky and make good use of it.\n\n(I'm not getting anything for this review just so you know, i do not know the company or haven't had any agreements to do this with whatsoever. I took time & wrote this review wholeheartedly just so future buyers would know what a great product this is just in case they were having any doubts) 😊\n\nFor hard gainers... i'll DEFINITELY recommend!", "I gained 15-20 pounds in a month. No signs of slowing down. I am male, 5’10” and have floated around 160-165 pounds for years because of a fast metabolism and an inconsistent appetite.\n\nThat weight gain came after using about one bag of protein powder + regular meals. I use one serving (2 scoops) per day (with a few missed days bc…life), but I use very scant scoops (helps it lasts longer). I *highly* recommend using a blender to mix this thoroughly. I use my simple Nutri Ninja Pro. When you’re done blending, pour the shake in a cup and clean the blender immediately every time to make your life easier tomorrow. It’s much tastier blended with ice (about 1/2 cup) to dissipate the sweetness – it’s also more refreshing with little pockets of cold. I use whole milk instead of water, about 3/4 cup. Blend in more milk until the consistency is acceptable to you, like a milkshake rather than like pudding (eck).\n\nIt’s kind of a heavy drink and sometimes makes it difficult to eat other food, so I usually try to drink just 1/2 in the morning, stick the rest in the fridge, and drink 1/2 at night.\n\n~~\n\nI’m noticing full body gains, but most prominently in my legs (thighs and glutes) and arms. It seems to be mostly muscle. I highly recommend adopting a regular exercise routine, including weights, for the best results with this. I think working out helps ensure your gains are in line with the physique you want, if you have physique goals.\n\nI started doing StrongLifts 5x5, which only requires 3 workouts per week. Takes about 45 minutes and it’s 3 basic compound movements/lifts per workout, done every other day. I swim laps on 3 of my “off” days with one completely off day. So, I’m always getting a full body workout, although SL 5x5 has you squat in every workout, and that really develops the lower body – and, conveniently, working your lower body enhances the rest of your body’s growth.\n\nDo whatever you want, but it’s nice to keep it simple and consistent.\n\n~~\n\nThat’s about it. Drink plenty of water (it can dehydrate you in the beginning) and get enough sleep. This stuff works well.", "*THIS REVIEW IS FOR THOSE OF YOU WHO ARE LOOKING TO SEE IF YOU CAN DRINK THIS AND GET RESULTS WITHOUT WORKING OUT...... READ AND LEARN FROM MY EXPERIENCE!!*\n\nI was always at the 150-160lbs range my entire life and looked skinny even though my height/weight BMI said I was basically in the perfect range. I tried eating more and drinking more of these, went through about 5-6 bags but wasn't religiously taking in as much calories as I could to try to gain some mass/fat/weight...\n\nAs the title says, this is for whoever might be NOT working out and looking to buy this.\nTwo months ago I went thru some crazy epiphany evolving ego death and glimpses into the future of where my soul would go if I kept doing the negative stuff I was doing, etc of which I'll spare you the details.\n\nI weighed myself and I was exactly at 162lbs.\nI can't cook for #$$% so I asked my mom to make some homemade food for me that I could keep in the fridge/freezer so I could eat 3 \"real\" meals a day and not just fast food. Being the best mom in the world that she is, she made me 3 meals a day and I would just go to her house to eat most of the time to eat with the family. After every meal, I would drink a full serving of the Serious Mass. I used whole milk, 2 heaping scoops, 3 big spoonfuls of peanut butter, huge drizzle of honey, and a drizzle of Hershey's Chocolate Syrup. I didn't notice much difference until about a month of doing this. I tried wearing a few shirts that had fit me loose, but now they were almost stuck to my body (but I still didn't have a FAT belly). I did notice overall \"gains\" in mass in my upper chest/shoulders and especially my upper back. Remember, I NEVER ONCE WORKED OUT OR EXERCISED DURING ALL OF THIS.\n\nFast forward to the end of the 2nd month and now I have a visible FAT BELLY THAT I CAN'T EVEN SUCK IN - WHEN I DO SO, I CAN STILL SEE THE FAT AREAS.... Before all this, my stomach was flat and had NO FAT, when I sucked in my belly it would slightly go IN..... NOT ANYMORE.....\nI'M TYPING THIS WITHOUT A SHIRT ON, SITTING AT MY COMPUTER, AND I SEE 3 LAYERS OF FAT ROLLS DESCENDING DOWN TO THE LARGEST ROLL THAT STOPS RIGHT ABOVE MY WAIST LINE. I NOW EVEN HAVE SOMEWHAT OF \"LOVE HANDLES\". I CAN GRAB MY STOMACH AND MAKE FACES WITH IT. I CAN GRAB MY STOMACH AND MOVE THE ROLLS AND MY ENTIRE BODY MOVES WITH IT. WHEN I WEAR A PLAIN TEE SHIRT, MY STOMACH STICKS OUT AND IS VISIBILE (NOT THE ENTIRE STOMACH THANK GOD, BUT THE MIDDLE SECTION JUST KIND OF POKES OUT AND THE SHIRT RESTS ON IT IF YOU KNOW WHAT I MEAN). I TRY TO INHALE AND SUCK MY BELLY IN AS HARD AS I CAN AND IT ONLY WORKS FOR A MINUTE BEFORE I HAVE TO EXHALE AND MY BELLY JUST PLOPS RIGHT BACK OUT.\n\nFOR 29 YEARS, I'VE NEVER GONE ABOVE 170lbs - I WAS ALWAYS 150-160LBS WITH LEAN MUSCLE.\nI AM NOW CONSIDERED \"OVERWEIGHT\" ON THE BMI INDEX - 30 IS \"OBESE\", MY CURRENT NUMBER IS 29.1 !!!!!!!!!!!!! I AM 5' 11\" AND 210 POUNDS.......................\n\nSO IF YOU ARE SKINNY, HAVE A FAST METABOLISM, AND CAN'T SEEM TO GAIN ANY WEIGHT -\nYES, THIS STUFF WILL DO EXACTLY WHAT IT SAYS. MIND YOU, LIKE I SAID - I DID NOT WORK OUT AT ALL.... WHICH IS WHY I GAINED SOME OVERALL MASS IN MY SHOULDERS/BACK BUT THE MOST MASS IS THE FAT BELLY I NOW HAVE.\n\nI advise you to NOT drink 3 full servings a day along with 3 meals if you aren't working out or exercising.\nI mean I knew I'd gain SOME fat, but 50 POUNDS in 2 MONTHS, AND 90% TO MY BELLY!!!\nMy fault, I know... but just KNOW WHAT YOU ARE DOING!!! UNLESS YOU WANNA BE MAKING FACES WITH YOUR FAT BELLY ROLLS!", "Rather than using this product for weight gain, it's been helping me with weight management. I'm typically too busy at work to eat properly, so I had been cramming all of my calories in at the end of the day which was causing my metabolism to yo-yo. I was eating so few calories during the day my body was freaking out and hoarding all the fat and going into starvation mode. I now have one to one and a half servings of this product during the day and it has completely stabilized my metabolism and weight. I have tried MANY other products for this purpose from expensive meal replacement shakes (Huel and Quest) to protein powders of all kinds and they have all tasted nasty, caused upset stomachs and diarrhea, or both. I am happy to say this product has never upset my stomach or caused digestive problems, and it tastes so good (chocolate peanut butter flavor) that I look forward to drinking it each day. I only use cold water to mix it since I don't have to mask the taste, but it is more shake-like if you blend it with milk and ice. Great product!", "this product has helped me tremendously. I have an insanely fast metabolism so gaining weight has always been difficult for me. in about a month or two I gained close to ten pounds. starting at 115. two scoops is one serving size but I fully recommend using one scoop (half a serving). half servings are like regular shakes and are much easier to drink then the intended full two scoop serving. a full serving of any mass gainer is extremely thick and almost like sludge. the flavor on this powder is good and only tastes chalky if you don’t properly blend. I also add alot of ingredients like almond milk, fruits, steel cut oats, peanut butter concentrate and sometimes bananas. highly recommend this one because it’s the most bang for your buck. only downside are the flavor options.", "This works great, I'm 6'1\" was always 150 - 170 since high school and I'm 35 now. The last 2 years I finally made it to 200 and 215 at one point. I have a fast metabolism and I only use it to maintain my weight now, originally used it twice a day, once in the morning, and before bed I used two Cups of milk 2 servings of peanut butter and just one big heaping scoop. You will gain weight doing that, even if you're just having one large actual meal a day, but now I just make a shake in the morning, However I just found out from my girlfriend that they sell one of these for $24 at Walmart so don't buy it on here it has gone up a few dollars every couple months for the last 2 years this used to be $30 on Amazon, don't get suckered in with their inflation prices this is price gouging like when people were selling rolls of toilet paper for $20 a roll during the plandemic.", "I've used this product for around 2 years now. First year I had Invisalign and used this as a big breakfast meal replacement to skip lunch. Second year used this for calories and building muscle.\n\nAt the beginning I had some negative side affects as others have mentioned, but my body soon got used to it after daily intake. I only recently saw the comments about Maltodextrin, which explains a lot. I will finish the last of my bag, but I will not be buying anymore of this.\n\nThis can help gain weight, but the main factor in changing your body is actually excercising. Eat healthy instead of this, your body will thank you.\n\nFlavor reference:\n-Powder: I used 2 scoops (about 15oz). Not heaped as it recommends, but about 4/5 a scoop to prevent spilling when taken out of the bag.\n-Liquid: I used whole milk (about 20oz. If using less than it becomes too thick and grainy). It makes it more smooth and creamy. Water will work if needed, but I do not recommend it. Lower fat percentages of milk are alright, though the lower it gets the more it leads to my water comment. Almond milk makes it thicker, adds its flavor to it and yet also somehow makes it watery.\n-Blender: Ninja QB1004 48oz blender. Mix for few seconds, do something for few minutes, mix for few seconds again. Ensures complete incorporation.\n-Eating: 35oz is too big, so I pour it into a bowl. Gulp down as much as you can in one go to reduce size while still hungry, then drink rest normally over some minutes.\n\nFlavors in order of preference:\n-Vanilla = 4/5; Feeling: light; Taste: a flavor you could convice yourself is vanilla-like.\n-Banana = 4/5; Feeling: light; Taste: faint banana flavor, similar to artificial flavor of laffy taffy or a popsicle.\n-Chocolate = 4/5; Feeling: medium; Taste: a thick version of chocolate milk.\n-Chocolate Peanut Butter = 3/5; Feeling: heavy; Taste: kind of cream-like taste with a unique flavor that you could convince yourself is peanut butter (Hard to describe).\n-Strawberry = 1/5; Feeling: light; Taste: cheap Fruity Pebbles aftertaste with a tinge of chemical flavor (not as horrible as other reviews say, but not really worth trying)", "Trying to gain weight, and this certainly helps. Some milk and a scoop of this in my MagicBullit mixer cup - slap on the lid and ready for the ride into work knowing I have something good going on that day.\nThe flavor is awesome. So glad my daughter found this for me on Amazon", "I usually run around 180 lbs. I recently had spine surgery. I got down to 146. After about 25 days, I got back up to 177! I also watched healthy and lift weights. But this was a huge help! Highly recommend to anyone looking to add some lbs.", "Huge bag and huge scoop. It tastes okay in smoothies but not just mixed with water I have to chug it like that. I always brush my teeth right after because it makes them feel weird. It definitely makes you gain weight if you do it the right way.", "This is my first rodeo with weight gainers. I read the reviews and chose this one. I like the flavor and it mixed well with juice or milk. I don't use a full scoop, it seems like 2 much. I use the first line since I'm just starting with it. My issue is that it gives me bad stomach aches and diarrhea. I know that it's the powder because I wasted some on the floor. My puppy locked it up while I was getting the mop. When I took him out, his poo was really loose, like mine was (sorry). I'm going to keep using it to try to get used to it. If it becomes too much for me, I will discontinue using it and update.", "Great flavor, 2 scoops per 24FL oz so great size for the price.", "I don’t have a scale at home but when I’m consistent with this powder I see a difference in the way my clothes fit for sure.", "Buy in bulk is the way to go good stuff", "I’ve had other mass gainers but this one will randomly force me to throw up and give me hot sweats right before getting sick. Not pleasant. But definitely gave results for the times i could keep it down and had zero sickness.", "Great taste. Easy to drink. Add chocolate syrup", "Optimum Nutrition Serious Mass Protein Powder offers 50 grams of protein & 1,250 calories per serving- which is substantial. As you’ll see from my pictures it also carries a ton of vitamins & minerals one should have on a daily basis. The ingredient quality is wonderful. Now these pictures are not shown on the Amazon description page for this product. What also isn’t shown is the fact this 6 pound jug I purchased for my teenage Son comes with ONLY 8 SERVINGS PER CONTAINER. 2 heaping scoops blended with 24 ounces of fluid to your liking gets what shows in my blender. It’s a drinkable amount with no problem. The chocolate flavor he likes. I’ve found it’s best to mix with milk as water tasted too bland. My issue is I felt I was misled in purchasing this 6 pound tub & not realizing there would be only 8 servings I’d get out of it. Since no pictures or written description mentions this, the buyer has no idea. The jug is enormous but is literally 1/2 full. I do feel there is 6 pounds in here but why waste so much plastic? At $45 a jug I’m undecided on purchasing this again. He just began taking it. After 3 uses he’s gained 4 pounds with lifting twice. Bottom line a quality product but an expensive one. I hope my information helps in your decision to purchase the jug or not.", "I've been meaning to post this for months...\nIf you or someone you know wishes to gain weight this is the product. I've personally used it after an extreme lost weight ( I am perfectly fine now-it was not health related moreso mental health related). Some people emotionally eat when they're having difficult times well, I am the type where I will not eat...literally. After some time, trying to eat foods made me gag, so I said I'll drink my meals. I got strawberry (not a chocolate fan). You must blend it and it's best with oat milk or Almond as it may make you a bit gassy on its own so adding dairy can increase that 😫😳, unless you need the fat.", "eat a healthy diet with this protein shake but health problem might be a factor if you don't see results or stress or it's just not for you.", "A product that actually works and my top flavor preferred is strawberry. I gained 7-10 lbs in one week (taken with meals) so if you’re looking to gain some gains this is it."]}, {"link": "https://www.amazon.com/dp/B00028NZ34", "title": "Boiron Chelidonium Majus 30C, 80 Pellets, Homeopathic Medicine for Indigestion and Nausea", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/71f1Wl70OtL._AC_SX569_.jpg", "ratings": "329 ratings", "description": "Boiron was founded in 1932 in Lyon, France, by twin brothers and pharmacists Jean and Henri Boiron. As the world leader in homeopathic medicines, Boiron is a $852 million public company with 3,700 employees and distribution in 59 countries. It is best known for Oscillococcinum, a top-selling flu medicine, and its Arnicare line of pain relievers. For more than 80 years, Boiron has been committed to funding scientific research and educating the public and health care professionals on homeopathic medicines. As a pharmaceutical company, Boiron maintains the highest standards in manufacturing, complying with U.S. Food and Drug Administration regulations, the Homeopathic Pharmacopoeia of the United States and drug Good Manufacturing Practices. The company partners with brokers, distributors and retail chains to make homeopathic medicines available to a wide variety of consumers and physicians. Boiron’s staff of 120+ consists of pharmacists and lab technicians, accounting and IT personnel, marketing & public relations staff, national sales force, customer service, and order fulfillment and shipping professionals—many of whom have impressively long careers with the company. Our mission is to stimulate the evolution of health care by promoting homeopathy as a compassionate, ecological and comprehensive approach to medicine. At Boiron, we believe there’s more than one way to feel better. Since 1932, the Boiron family has been committed to providing quality medicines. As world leader in homeopathy, our passion is your health. Our promise is your satisfaction. Watch our videos to find out more about Boiron USA.", "reviews": ["Great for bloating", "I had severe gallbladder attacks. I thought I would spend the rest of my life popping Tylenol to handle the pain. After researching the topic I discovered this homeopathic remedy. For me it was a godsend. I dealt with my issues at the root but every now and then I will feel that pressure or pain in my right side and I take a dose. Within seconds the discomfort is gone!", "Was advised surgery for removal of gall bladder in March 21. Since being on chelodonium I have not had surgery.", "My wife used these when she had a gallbladder flare up & she actually felt worse after using them.By rights,this product doesn’t specifically indicate that this is used for gallbladder issues,but for nausea with pain on the right side.These are common symptoms of impaired gallbladder function or an actual gallbladder attack.We purchased this based on a review that someone posted regarding it really bringing relief to their gallbladder issue.She tried it for two weeks,& had to stop taking it.Not enough information is provided on this product to make a purchasing decision", "Theses are the only thing that helps nighttime reflux. I’d be lost without them", "Am using this along with Boiron Phosporus 30C for liver congestion due to chronic Lyme. I am noticing subtle changes after about 3 weeks of use. No side effects, no contraindications with any meds & I use homeopathy extensively because it works with your body to help it correct imbalances. Highly recommend!", "Wonderful customer services & awesome product", "There is no detailed data on this product anywhere on the website. I took the pellets for a liver condition but it just tasted like a sugar pill. I don't think the bottle indicates how much of the active ingredient is actually in these pellets. I read somewhere that there is only about 1% of the active ingredient per pellet, but I don't have documented proof on this so please use at your own discretion. I just wish that there is more scientific literature about these products. I purchased this after reading a case report on this and other related products that cured liver disease, but without knowing what the proper dose for these products are, I have become more skeptical about Boiron products in general.\n\nI understand that these products are very popular in France and other European countries, but at this point, I cannot recommend using these products until there is more evidence-based studies on them.", "Homeopathics work when well chosen. This one helps with keeping the bile flowing. It helps me.", "I explained in the chat room and with the distributor that these did not phase my indigestion. Instead of sending return label, they sent one more tube. It was like one little container out of 4 I believe. If you purchase a product like this at walgreens, walmart, target etc. they will let you return. It's not like I buy products hoping they won't work. I will be interested to see if this review actually gets posted. I' m not saying bad product. Just saying did not work for me. I am by myself and only way to get things is to order or I would have stopped Amazon long time ago.", "Easy to use and fits in a pocket to take along.", "Wonderful homeopathic remedy", "Bought for my homeopathic first aid kit!", "Good", "I have non alcoholic liver disease and feel a lot of pain in my liver when trying to digest fats or proteins, this product helps reduce the pain in quick fashion when taken with my meal.", "Excellent when my liver gives me digestive problems.", "Excellent for gallbladder issues and trouble digesting fats or belching after meals.", "This product works every time I use it and I have ordered this many times and appreciate the quality.", "Love it!", "Works well!"]}, {"link": "https://www.amazon.com/dp/B0006JLW4I", "title": "Camco 25153 Vinyl Trim Insert (3/4\" x 25', Beige)", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/71hW8jVY2-L._AC_SY606_.jpg", "ratings": "303 ratings", "description": "Camco 3/4\" x 25' Beige Vinyl Trim Insert is an easy-to-install replacement for cracked and stained trim inserts on aluminum roof edge, trim molding and truck camper shells. This Vinyl Trim Insert is made with UV inhibitors which provide a longer life.", "reviews": ["So much thicker then what came on the trailer. So far I am happy with this. My front storage door seal was to soft and would not stay in and while driving would continue to flop out. Resulting in me having to pull over to repair/remove the old trim. So this newer trim is stiffer then stock and I plan on buying the 1in for the roof trim when I do the roof trim on my next project. I recommend this item.", "perfect for what I needed.", "This product is very thin and no way to bend it for corners so it will keep its shape once bent so it springs back to straight.", "Exavtly what I was looking for!! This protective cover/strip goes down each side of the entry door on my camper. One side kept coming loose and sliding down. I stuffed it back in a few times, but eventually one of our highway trips claimed it as ot was no longer there when we arrived at home.\nThis roll is an exact replacement. Easy to install. Restores the original look and protection. Very glad I found this simple product. Highly recommend!", "My 2003 F150 has two channels on the cab roof that look really bad. Newer models have a black vinyl strip inserted in it. I ordered the 1 inch. I needed the 1.25. Product is good. My measuring is lacking.", "Fit good, easy to install, used to replace the trim around the door on my r.v..", "I have a lovely old 1950 Kitchen Table that had long ago had the covering for the screw trim destroyed. While at an RV store my husband saw something like this. So I of course went to Amazon.\n\nThis does a great job of covering the screw trim. Husband states it was a bit stiff to install but it does look good. (the chrome was all a mess so he had applied a brown spray paint to the legs). -- my biggest wish would be for more colors.", "Fits perfect", "Nice to have new molding", "I didn't get to use this because I ordered the wrong width. So, I passed it on to a friend who did use it on his RV and is satisfied with the result.", "Perfect!!!", "Great product and worked as advertised. Installation was difficult and you need to be sure it's warm so it's pliable to install", "Vinyl trim was an exact match to replace my weather stained trim around the three storage bins. The trim was used by my manufacture to cover the door's installation screws. Tip: Use a blow dryer to heat the vinyl and make it pliable enough to bend into the retaining grooves. Manufacturer should have said that rather than our trial and error😀", "Easy to install", "Exactly what I needed! 3/4 inch and fits just like original!", "Kind of difficult to mend. Warm day or in the sun would help application. Careful not to over stretch if it gets to warm.", "I trimmed my RV with it. The trim looks like new, which it is, cause I just bought it.", "Very thick and easy to work with as long as it's 65 degrees or warmer and sunny. We replaced the old on our 15 year old RV that had shrunk up and was letting water get behind it and into the inside.", "Fits the track but kind of thin vs the OEM extrusion. Bright white.", "great quality repair item."]}, {"link": "https://www.amazon.com/dp/B0006O2PBW", "title": "Little-Trees Black Ice Little Tree Air Freshener- 24 Pack", "img": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T2/images/I/91tlSRAnrFL._AC_SX425_PIbundle-24,TopRight,0,0_SH20_.jpg", "ratings": "12,287 ratings", "description": "Add a little fragrance to your life with the world-famous Little Tree air fresheners. Black Ice has a brisk, clean scent and bold, attractive packaging. Like all Little Tree fragrances, it's high-quality, strong and long-lasting. Hang it in your car, home or office.", "reviews": ["My favorite scent of all the little trees and seems to last the longest in my opinion great item.", "Strong scent that last about 2 weeks", "A veryyy nice smell, it lasts for a few days", "Smell great, just like new leather, just wish it lasted longer!", "Scent doesn't last that long", "When is fragrance came out I really fell in love with it it’s a rich smell a refreshing fragrance I must have", "This is the best scent in the little tree series. I bought these for home after our AC had a weird smell and needed cleaning. They were hung in front of the split AC vents and worked wonders.\n\nThe best part is you get used to the smell very quickly. It may come off as a strong fragrance for the first couple of hours, and then you will forget about it, with only a pleasant smell lingering behind.", "We us this product in our vacuum and rv air conditioner . Works great", "I use in our vehicles", "Ordered some more", "they dont seem to hold there fragrance fr very long, but, they smell awesome.", "Surprisingly I don’t mind the sweet scent of these. It’s not too overwhelming & these seem to last a long time, especially in a hot car during the summer haha. I’d buy these again.", "I combined it with the strawberry and smell great. Last at least two weeks. A+", "These smell amazing. But for the sake of humanity, please resist all urges to eat them. They’re not eats.", "Exactly as expected 🙂", "long smell.", "This filter saved my family.\n\nHave you ever opened your car door (maybe a few days in a row) only to find it smells like some combination of miscellaneous death? Like do you remember in the movie Grumpy Old Men when Jack Lemmon and Walter Matthau his dead fish in each other’s cars?\n\nThis was my reality a few weeks ago. Picture the family minivan. Naturally in this situation you start to wonder what the Hell kind of food the kids dropped that rolled under a seat and started to rot. You give the car an extended once over, an amateur’s attempt at detailing including pulling out and scrubbing all the floor mats. It wouldn’t be outrageous for the smell to have been dog poop on someone’s shoe so you scrub the floors just in case.\n\nBut still when you turn on the air blowers the smell of pure disgust blasts through the vents and saturates your amazing cleaning job (and your family).\n\nWhen your hubby checks the air filters, he discovers that the family minivan has been invaded by another family. It’s like a Lifetime movie where there’s someone else living in the attic and terrorizing everyone and making you think you’re crazy.\n\nOnly this time that family is a family of mice. And they didn’t make it. And your car’s smell accurately and intensely reflects these events.\n\nEven after removing the second family from the situation, their stench lingered. It takes some time to rid a family minivan of such a smell, but we decided we didn’t need to suffer through the process. And that’s where this car air freshener came in.\n\nBayside Breeze. Halle-FREAKING-lujah, what an amazing scent. I never would have imagined I’d be in this situation, and that a little scented tree shaped savior wrapped in plastic could bring our traumatized nostrils so much pure joy. You can even slowly freshen over time by pulling a little more tree out of the package—which is a great feature for making the most of one air freshener and increasing its longevity. And that’s what we will do with the second one in the package. But in our case, we went all in and took the glorious tree fully out of the package. You just don’t mess around with the lingering scent of the dead mouse family that snuck under your car and made its home in your air filter. You replace the filter and get yourself some of these.", "No es el mejor, pero es economico", "I love this scent.", "Last for a good while. Good value for the money"]}, {"link": "https://www.amazon.com/dp/B000BPB346", "title": "Camco 40103 Holding Tank Rinser with Shutoff Valve", "img": "https://m.media-amazon.com/images/I/51U9VnmB2iL._AC_SY879_.jpg", "ratings": "10,117 ratings", "description": "Camco RV Holding Tank Rinser with Shutoff Valve helps to completely flush out the holding tank. It features an easy grip handle and quarter-turn pressure-sealed valve which allows complete control of water flow. The side-placed jets clean and rinse the smallest, hard to reach places.", "reviews": ["We live in our camper full time. We've never had this particular issue with the black tank before but this hose worked great to fix it. The master bedroom is next to the bathroom and it started to smell in the bedroom each time we flushed. Did some research for a solution as the pods just weren't cutting it. (We also have a sewer connector that has a water hose hookup for better cleaning after we empty the black tank that we've been using for quite a while.) I came across this hose attachment and my husband used it and no more smell!! Whether you are living in your RV or just camping, I highly suggest getting this hose attachment for a better cleaned black tank.", "Our RV black tank had an odor that we just couldn’t seem to get rid of no matter how much chemical that we put in the toilet. After a weekend out with the RV we went to the dump station and emptied both tanks. I then used this tank sprayer and could not believe how much more yuk came out of the tank. There was quite a bit of toilet paper I guess stuck to the sides of the tank and the sensors. Now no more smell. Well worth the money. Highly recommended!", "We purchased a used camper that was in great shape. Upon our first camping trip with it we noticed every time we flushed the toilet the smell was awful!! Tried everything from treatments to leave in products. Nothing worked. Tried flushing with hose etc. a camper told us to try this. He had same issue. It was build up in tank. Ordered this and used it for about 20 minutes in tank. Open black water valve let it run. Then close it let it run open it again. Do this often. Beware!!! Make sure you have someone outside opening and closing it. The tank will fill up fast and over flow. You need to shut water off to toilet for the cleaning wand is put down in tank. It forces water out at end spinning. Lesson learned. Do not take out of tank without shutting water off on the unit!!! Works great!!!! No more smell.", "This wand worked great. Have tried the solid wand but my black tank would still show 3/4 or full when only 1/4 full. This flexible wand went down into the tank and cleaned all the sensors and my ready after dump is EMPTY, and that is great.\nWorth every penny!", "We ordered this because I bought the wrong toilet paper and clogged the toilet, oops. It cleared the problem right up and was super easy and not as messy as i thought it would be.\n\nDefinitely get yourself a good pair of gloves to go with it!!", "We'd been having some issues with the level indicators on our 5th-wheel's black tank. We have a 45° elbow not far below the toilet, so there's no \"straight shot\" between the bathroom and the tank. This little CAMCO device worked like a charm in snaking through the elbow and it cleaned the tank thoroughly without any issues. It was simple to use and built to high standards. We'll continue to use this on a proactive basis a few times a season just to keep things well-cleaned. Recommended!!", "Had a little issue with our sewer on our last River trip. Luckily our friends had this item and loaned it to me husband. Worked like a charm!", "Easy to use", "My censers were way off.Always read full even after I flushed the tanks so I found this little gadget.I always thought that it flushed everything out of the tanks when I emptied them.I flushed them.Then Filled and flushed again,Thinking I got it all so when I used this and flushed again.I could not believe how much came out.My tanks were squeaky clean.This is one of my better purchases that I do not regret buying because this,Actually works.I highly recommend this ...A++", "This thing works great, but buy the toilet gaurd that they sell for under 10.00. First try of cleaning I was covered in sewage. I ended up having to use handful of paper towels to block the spray back.", "Work great", "Sprayed down the black tank for about 10 minutes and have sensors again. Very impressed!", "Can be a little awkward to use due to having to drag a hose inside but well worth the effort. Before having the wand the toilet tank would smell aweful until deodorant tabs were put in and started working. After using the wand that problem no longer exists because it sprays everything off the inside walls of the tank so all waste can be completely emptied.", "This item creates good spinning pressure to wash out your black tank. The only negative that can’t be avoided is having to pull your water hose into the camper. Worked good for me.", "As advertised", "I like that it has a shut off valve on it.", "Iv'e used this product since 2011, with no problems. no leaks, after first use, the vibration noises did bother me was pretty loud. I modified the entire thing. my pipe goes straight down, I measured from the bottom of the tank to the top of the toilet valve, then from the top of valve to the bottom of the pipe 17\". the got a 2\" PVC pipe which fit exactly through the opening in toilet so to not disturb the gasket around valve I don't use the shut off valve on the stick, I connected a regular hose nozzle to the stick, just turn it on and use the lock on thing on nozzle, after centering the stick inside the PVC as best I could, I drilled and tapped 1/4x20 holes saced evenly all the way up the PVC 3 at each interval and used stainless s thumb screws, counting the turns to get it centered at each cotact poing just snug against the stick. make sure to use hose washers wherever the hose screws in I use grease on all hose washers to keep them soft grease both sides of washers. once all is centered and screwed snug with tuimb screws I drilled 1/4' holes along the stick and filled with spray foam insulation and trimmed off any excess out the top and bottom at the brass swivel . then paced 3 1/4x20 thumb screws exactly 18 inches from bottom of the swivel leaving the thumb part out from the PVC to keep it from falling to the bottom of the tank.\n\nIv'e read the reviews about not enough pressure, the trick to more pressure, is to pass as much water as possible through the smallest amount of area as possible. I relaced the airater in the bathroom sink with an airater with a hose connector on it, turn off the hot water heater so can use all the water coming in and not trying to heat the water passing through, I even put a shut off valve on water going into toilet so that water is going through the stick and not just running into the toilet serving no purpose other than filling the tank. I also bought a high pressure washer hose which looks more like a 3/8' hose rater than the standard 1/2' or 5/8'= smaller hose=more pressure, yes my swivel did stop spinning one time, but at the speed that thing turns it's going to get hot the water passes through it not around it keeping it cool it needs lubrication I plugged the two holes in the swivel with fresh bread, opened the shut off valve on the stick, used a funnel abd poured it full if 5-30 oil, hooked up the regulat hose nozzle, turn the ater on full blast and locked it, the bread will hold the oil in until the water is allowed to go through.once the water hose is hooked up open the shut off valve on yellow stick, the water will push the oil, pushing the bread out the oil will lubricate the swivel. I've probably used mine 100 times over the years the swivel has never stopped again.I leave the entire thing together in the storage unfer the camper. you'll need a male to male hose adapter to hookthe washer hose to the hose nozzle found at any hardware store for a couple bucks. when you need to use it, simply turn off hot water heater, put the unit into te toilet, screw the one end of washer hose onto the sink and turn bot sides of faucet on, in two minutes or less you're cleaning your tank without pulling any dirty hoses in throughout trailer!\n\nI'd rated this a 5 if Camco could design the swivel to move up and down like a drive through car wash, apparently there is something stuck on my 1/3 mark? when i clean it it says empty yetwhen I just empty the tank it always reads 1/3 on my sensors panel. I suspect the water is just running over the sensor enough to make it say empty but not blasting whatever it is off? I'm now using the detegent dispensor from my power wsher with dish detergent hopefully, after a few uses it wll clean tha spot? will revise this review if it does? the spray foam does make it a bit heavier but it sure made it simple to use", "I had a lingering odor after emptying the black tank on my camper. My camper comes with a sprayer bu reallly doesn’t do a very good job. I have been extremely happy with this purchase and would recommend it to everyone", "Does it's job that the poop on it :)", "Returned"]}, {"link": "https://www.amazon.com/dp/B000CIO5AQ", "title": "Toysmith Amazing Christmas Tree", "img": "https://m.media-amazon.com/images/I/71qPg13ND-L._AC_SX679_.jpg", "ratings": "293 ratings", "description": "Grow a miniature Christmas tree in a single day with the Toysmith Amazing Christmas Tree. Fill the tree stand with the magic water included in the pack, and watch it grow in just 24 hours. The pack includes a tree, a stand with water reservoir and a packet of magic water. Once the tree has fully grown, decorate it with the star topper, garland and glitter included in the pack. The Amazing Christmas Tree measures 6-inches tall when fully grown, perfect for a desk or tabletop display. Recommended for ages 5 years and up.", "reviews": ["Our elf on the shelf brought this and kids loved it! Just decorate then put water in and 12 hours later it’s a pretty full tree. Only lasted 2 days (and we didn’t touch it) but it was fun. Glad we bought it.", "Has lasted over two weeks!! The package said it would last like 3 days!! My kids have loved it! Definitely buying next year.", "Seriously, this is magical and so neat! Kids loved it! Adults loved it! Will definitely buy one every year for our elf to deliver. Our crystals (tree leaves) grew within hours.", "So cool! Lasted around a week", "My 4 yr old granddaughter and I assembled our tree in the evening and it was in full bloom by the next morning! So cool!", "Fun activity for kiddos", "Really cool! We all enjoyed it", "This is a fun and unique activity but people should be aware it is hard to move or transport if needed and it lasts maybe a week. All in all it’s still worth it and fun to watch it grow.", "This was a fun little experiment that my kids and I really enjoyed! I had been wanting to grow some crystals with the kids, so when I saw this fun Christmas tree, I jumped right on it! It was a fun activity especially over Christmas Break when we were home all day to watch the crystals grow. They really did come on quickly in the 6 hours as promised. Based on previous reviews and knowing the crystals would be delicate, we put on the star and garland at the beginning when we added the liquid. Definitely the way to go! We sprinkled on the sparkles when it was all done. I do agree that I wish a little more explanation was given on how and why the crystals formed, and what kind of crystals they were. Other than that, a lot of fun for my 7, 5, and 2 year old (and and their geeky parents, too!)", "Crystal growing kits seldom work in my house, but this one was a big hit! Easy to use and great big crystals that lasted a while.", "Great little gift for nieces! I have my nieces lots of little gifts for Christmas this year. They are 8-10 years old and like things like this. The funny thing was I wrapped everything like 3-4 times, they loved ripping off all the payers of wrapping paper. They got a kick out of seeing another layer underneath. Everyone had a good time watching the girls race to open the presents. I almost feel like that took an extra close look at what each gift was after working so hard to get to it. They were really appreciative and promised me pictures of their \"Experiments\" with it.", "The tree is great and you see the crystals grow in just a few hours. However, the service from eParty is terrible. I ordered 3 of the trees and they charged the full shipping for each one; the three trees cost $14.85 and the shipping was [..]! They did not answer either email I sent to them. I will never do business with them again or any other company that does not offer free shipping. I think a lot of companies are discounting thier prices and then really sticking it to you on shipping and handling. Unless it qualifies for Amazon's free shipping, I'm not buying!", "Took longer to grow than directions say but pretty cool. Don’t touch after it grows though because it’s very brittle.", "Grows quickly overnight. A fun thing to do with the kids on Christmas Eve. The glitter is pretty, but don't waste your time putting the \"garland\" string of beads on. The crystal completely covers it and you won't see it anyways, and the tree is too fragile to apply anything other than glitter after it grows. The only problem I had was that my son loved it so much that after a week, when it started to dry out and fall apart and make a mess, and I had to throw it out, my son cried his eyes out to see it go!! By the way, it does say on the package that it is only supposed to last a couple of days, so it far outlasted its life expectancy.", "Fun and educational...if you know how it works. =)\nIt did exactly what it said it would. It lasted a couple of days longer than it said it would so that's a plus.\nMy only complaint is that if you bump it or move it the \"tree\" falls apart, crumbles everywhere, So maybe if the little dish was a little bigger it wouldn't be so bad. I would put it on a piece of construction paper or something of the like next time.", "Excellent choice for a magic crystal kit. Quite a bit larger than the other trees (not Christmas themed) we have tried in the past. The package claims it will only last a couple day, but we had ours up about two months. The trick is to put it somewhere that it will not be bumped or shaken. Place it there before you grow it, as the crystals are very fragile and will break easily when moved. It is great fun for children to watch how fast these crystals grow and I highly recommend it for a stocking stuffer.", "This Christmas tree is so much fun! It really does grow over the course of a single day (though it will be a little bigger the next morning). If you leave it alone it will last for as long as you want to keep it around. The decorations that come with it are incredibly cute (little string of red beads, glitter, and a star). I've given it as a gift to quite a few friends who were otherwise Christmas tree-less at the holidays. It probably isn't great for little kids - it's pretty delicate once the crystals have grown. I think they're non-toxic, though.", "I sent this as a gift to a friend who wasn't going to have a Christmas, and surely not a tree. I wanted some kind of fun for them so I sent this. She said the instructions said to put the bead decorations on first and then let it grow which proved to be a bit tricky. It grew overnight making the surprise the next morning even more fun. She said it didn't come out just like this picture but close enough to be a tree and she was thrilled with the surprise.", "I bought one of these when I was in Urban Outfitters. I thought it would be fun to have on my desk at work. It was horrible. It didn't absorb the water all the way and fell apart instantly. Then I found this one on here and figured why not give it another try. Well, the one I ordered was great! I gave one to my niece and nephew to keep in their bedroom and I think its still there right now. Its just something small and cute to have for the holidays. I bought another one for my desk at worked and everyone loved it.", "We've had other little trees and love watching them grow. Thought I'd try this 6 inch Christmas tree and loved it, too. The decorations were cute. It only took a few hours to start, was complete within 30 hours.\nIf you've never done one of these before here's a tip - Don't touch or move the branches or the crystals will fall off."]}, {"link": "https://www.amazon.com/dp/b000ewht4y", "title": "Natracare Non-Applicator 100% Organic Cotton Tampons, Regular, Totally Chlorine Free, Biodegradable and Compostable (12 Pack, 240 Tampons Total)", "img": "https://m.media-amazon.com/images/I/81dYfOHJRVS._AC_SX569_PIbundle-12,TopRight,0,0_SH20_.jpg", "ratings": "84 ratings", "description": "Healthier by nature. 100% Cotton. Certified organic. Non-chlorine bleached. Why organic tampons? In 1989, Natracare was developed as a direct response to health and environmental concerns about dioxin pollution by chlorine bleaching, the use of rayon in tampons, and the extensive use of pesticides on conventionally grown cotton. For over 15 years, Natracare has been trusted by women who see the good sense in making a natural choice in tampons, pads, panty liners and feminine wipes for their monthly cycle. It makes sense to choose a tampon that is made from only certified organic cotton to avoid unnecessary exposure to chemical residuals and synthetics. Natracare Organic cotton tampons and chemical free pads are high quality products made from only pure and natural materials that are not chlorine bleached and are free of rayon, plastics and synthetic materials. Made in Germany.", "reviews": ["They don’t have any applicators included like their other products - tampons are just individually wrapped in plastic instead of recycled paper packaging.", "I’m a relatively health conscious individual and have been gradually making changes into a healthier lifestyle.\nI kind of always knew how awful regular tampons were for you (I mean it’s terrible that us ladies have been sticking bleach and pesticide infested cotton up our lady parts for YEARS. I mean, no wonder so many woman have ovarian cancer!), but was always pushing off making the switch because of the price of these things! I mean, I can get 5 cancer sticks (aka regular tampons) at Cosco for the price of one of these. And that certainly adds up over time! But then again, so does the cost of harming the body with all those chemicals. Urggg.\n\nSo I finally decided that well-being was vastly more important than a few extra bucks each month and thus, made the switch these little bullet looking things, which I call 22’s. Check out the pics and tell me it doesn’t look like the bullet for a 22! I got the kind without the applicator, because it’s less waste for the environment and (ok I admit it) mostly because it was cheaper.\n\nI was actually kind of freaking out about the no applicator thing (I mean how gross that I have to …well, I’ll leave out the details). Well, it hasn’t been nearly as bad as I thought it would be. I mean, it took a few times for me to get used to it, but again, definitely not as bad as I thought it would be. Actually, I’ve found that an AWESOME perk about the no applicator is that it’s SO small and compact that it takes up virtually no room. Stick one or 2 in my pocket on a night out and I’m good to go!\n\nLast thing to make note of... Again, it might be TMI but heck, what did you expect to get from a tampon review?! So before I had reformed my ways and was still buying cancer sticks, it would sometimes get itchy up there in lady world and would just feel …hard to describe…itchy/uncomfortable/not clean. Since I’ve switched, that never happens anymore! Yay! I’m pretty sure it was my ladyhood revolting at me in the presence of such unclean cancer sticks.\n\nI was NOT paid to do this review or given any free stuff. I did it because I’m hoping that more ladies will make the switch. I know it’s more expensive but your well-being is vastly more important than a few dollars. Trust me, I’m an expert ;)\nAnyways, hope you enjoyed the review and that this helped. Please leave comments or questions if you have any and I’d be SUPER appreciative if you’d be so kind as to rate my review :D\n\nP.S. A few people commented about this being so hard to unwrap. They must have updated the product because it now has an easy peel flap in the middle. I took a pic so you can see what I mean.\nXoxo", "Organic cotton tampons are more expensive than rayon, but they're made with fewer chemicals and the fibers cause less trauma to the vaginal walls so I use them religiously. This one is a great product, easy to use and transport, and since I bought a case I won't need to buy tampons for over a year (FYI, I do the same with the Natracare breathable panty liners -- the only ones that don't leave me with a yeast infection since standard liners with plastic build up moisture).\n\nThe case is pretty compact, so storage isn't a problem and I get to enjoy both savings and convenience of not buying tampons monthly. Keep in mind these do not have an applicator, but I prefer this because they're more discreet (I can hide one in the palm of my hand or pants pocket) and also create less waste than the applicator versions.", "I love these. They are hard to find in stores, and more expensive there to boot.", "Love these things. Buying by the case, I can keep enough tampons everywhere and not worry about running out every time I get my period. And theyre organic so thats important to me. Maybe they could be more comfortable but they are perfect for me in every other way and periods just arent comfortable in general so the pros outweigh the cons", "I used O.B. before. Then suddenly that brand became unavailable EVERYWHERE. I hate plastic and applicators and all the waste. I hate the tampons that grow longer instead of wide.....Blah\n\nThese are comparable to O.B.. I did have a little less cramping...but not much. They are a bit more solid....almost to hard to absorb at first...I found that if I loosened it a bit by sticking my finger in the string end and scrunching it a bit, it made it a bit softer and more absorbent right away.\n\nHave switched to a cup now, but still carry these around for emergencies. Very nice product.", "I get these in bulk for my lady and it makes me a hero. Not only do I care about her body I also care it's as natural as she is.", "Item was damaged and received only one pack, not 12. I want my money back!", "These tampons are really good. It takes a little getting used to not having an applicator, but it's not a big deal.\nMy mind is at ease knowing the fibers are organically grown and do not contain harmful chemicals.\nThey can be a bit tricky to open at times, but mostly they are excellent. I also love the fact that buying them in a large quantity means I have plenty on hand and do not have to reorder frequently. Buying the case is definitely worth the investment and saves money.", "I was looking for an environmentally friendly choice that did not have either a plastic or cardboard applicator. From the reviews as well as the product description, this seemed like a great option. I would have given it a higher rating, however, I find that the outside wrapping, especially when I am in a rush, can be impossible to get off. Once they improve this aspect, I would increase my rating although I will still continue to purchase it. It is comfortable, just as good as the less environmentally friendly products, and a worthwhile choice.", "I used to be a die-hard OB user or nothing. These tampons changed my mind. They work better and make me feel better using an organic product instead of non-organic that is treated with pesticides. Would recommend!", "Can't believe it took me this long to find these! Only reason I rated them four instead of five stars is cost. Wish they were more affordable.", "My nether parts are much happier with these than with o.b., which has in recent years made some changes to their tampons. The past couple years using o.b. tampons, I've been having yeast infections after most periods, and tampon removal near the end of my periods has been painful. Since buying these tampons a few months ago, I'm not having these sorts of symptoms so far. Planning to try their pads now too.", "No pesticide sprayed cotton! ;) Treat yourself to cancer free coverage.", "ever since I read about cotton being made from the parts of the cotton plant too high in pesticides and chemicals to be feed to cattle, I use only organic cotton for personal items. These items are easy to use, easy to conceal, discreet and effective. I shared them with several friends who didn't know they weren't conventional and never noticed a difference in performance.", "Awesome Organic product without toxic chemicals", "Great product, I made the switch in June 2016 and will never go back.", "I like these tampons for their organic properties, but I just wish they would be easier to open!", "As tampons, these work fine, but it is incredibly difficult to open these. When I'm having to change these, I don't want to spend 5 minutes trying to get the seal open. I've had to resort to using scissors because the seal is ridiculously difficult. It's actually very frustrating and I can't wait to be done with this pack. This is the sort of thing you want to be able to do in and out super fast, but unfortunately not so. Please, please improve your packaging!!", "I bought these years ago for my daughters but they wouldn't use them without an applicator. That was a waste. My bad."]}, {"link": "https://www.amazon.com/dp/B000GWG7TK", "title": "Garden of Life Super Seed - Vegetarian Whole Food Fiber Supplement with Protein and Omega 3, 1 Lb 5oz (600g) Powder", "img": "https://m.media-amazon.com/images/I/81uNP+eIWcL._AC_SX569_.jpg", "ratings": "2,035 ratings", "description": "Super Seed is a powerful whole food formula that is an excellent source of dietary fiber. The ingredients in Super Seed were specifically chosen for their exceptional ability to support and maintain optimal bowel health and function. Many other fiber supplements rely on insoluble fiber alone and provide very little in the way of nutrition. Super Seed contains both naturally occurring soluble and insoluble fiber from carefully selected grains, seeds and legumes that are easy on the gastrointestinal system. Additionally, Super Seed contains no psyllium.", "reviews": ["Super Seed is effective as a fiber supplement. It has helped me with regularity, as I have a neurogenic bowel from a spinal cord injury. It does not taste good. I tried mixing it with water on day 1, and it was a gloopy mass. Now I mix it with applesauce, mix in some water, and eat it quickly before the flax seed thickens it too much. It is not enjoyable to eat, but it does work well.", "I have been loosing 1 to 2 pounds a week using this product, I just don't eat anything after lunch and drink some of this at night when I'm feeling hungry. It fills me up and takes away any hunger pangs I may have had. Already lost 30 pounds fasting and using this product. It is working for me.", "This stuff works pretty good! Don't start with a whole scoop! Start with a quarter scoop. Work you're way up. I eat it on buttered Graham crackers. If you put it in liquid it turns to sludge. Oddly it has a slight cinnamon taste to it.", "I add Super Seeds to my smoothies for the extra fiber and claimed health benefits of the various ingredients, but I have no way to know if I'm healthier because of the Super Seeds, but I think that's true with most supplements.", "i like the taste of this, its easy to mix and use.", "I really enjoy this stuff and want to take a minute to share my experiences using this as a fiber supplement in case it's helpful to other people. I go to the gym in the mornings and also take medication that works best on an empty stomach. Working off of an empty stomach after hitting the gym can be difficult, so I have added this to my daily routine each morning. This stuff isn't for everyone, especially not for people who have issues with certain textures. It definitely clumps up a lot if you allow it to do so and there is nothing worse than getting a big clump of this stuff when trying to pound it down.\n\nTo avoid clumping I use a 32 ounce Nalgene with a lid and add about two inches of water. Then I take a full scoop of the powder and shake about a third of it into the container. If I see a big clump on the scoop while doing this, I break it up with my finger before pouring it in. After adding a third of the scoop I put the lid on the container and shake it well. Then I add another inch or so of water and half of the remaining scoop and repeat with adding water and shake. Do this one more time to finish the scoop of powder and fill the container to the top and shake vigorously. This is the only way I've found to avoid clumping. Adding one whole scoop at once always results in clumping. The clumps float to the top and can be broken apart with a fork but why deal with that when you can just avoid it all together. Please be aware that this supplement has actual chia seeds and various other seeds/sprouts in it that do not dissolve. This won't go away no matter how much you shake!\n\nThis process may seem like a pain but it only takes a minute and makes it a lot easier to guzzle it down. I know 32 ounces of water may seem like a lot for some people but you just have to get used to chugging it down. Don't let it sit too long because the chia seeds start absorbing water and become a little gelatinous. You should be drinking plenty of water if you want this stuff to work efficiently so this is a good way to get some of your water requirements (or goals) for the day out of the way. I try to get it all down within 10 minutes of making it. Then I'm set for the day!\n\nNot only does this do the job in the gut department, it also helps me feel full and gives me a boost of energy that gets me through until lunch time when I can eat something with some substance to it. It also feel like doing this allows my meds to kick in better. I take them about two hours before the fiber drink.\n\nI see a lot of people saying that this stuff doesn't work for them and my boyfriend tried it for a few months and also said that it didn't help him in the bathroom department, but that's because he wasn't drinking enough water throughout the day. He preferred to drink his mixed with a bit of water in a coffee mug and then didn't drink much water throughout the day. Using a small amount of water makes it incredibly sludgy and gross so I have no idea how he even stomached it. I'm not saying you have to drink a ton of water the second you take it if you prefer to use less, but if you do plan on using it be sure to drink lots of water consistently, even on days you aren't using it.", "hope it works.", "This is a great amount for the price. So a really good deal. There is no flavor so I put it in my oatmeal or smoothie in the mornings. It has worked great for me also. It does what I need it to.", "I purchased it to go in smoothies and save a fortune compared to what I spend at a well known smoothie shop", "Took about a week to truly start to work. Keeps me pretty full to where I can either skip a meal and or eat less. I have lost a bit of weight and I’ve only been a few weeks on it. Great taste.", "Absolutely love the cinnamon taste of it!", "I blend a couple tablespoons of this with a little milk. It's healthy probiotic goodness with a lot of fiber and a fair amount of protein. I drink it right away after I blend it, otherwise after a few seconds it starts getting super think. Best to follow it with some water to aid digestion.", "I did not enjoy the flavor of this product. It's a bit fruity and I personally really taste the cinnamon. Just doesn't work for me.", "This is a good fiber but it's too messy and to dense. I found if i waited too long to drink it the mixture would clump", "Pleasant taste, but if you're looking for something that completely dissolves in liquid, look elsewhere.", "I'm trying to listen to my Dr. for a change and I decided to add more fiber to my diet. I wanted to add a supplement and I tried the orange flavored stuff. It was OK, but I wanted something that tasted more natural than like clumpy Tang with artificial sweetener.\n\nI purchased Garden of Life Super Seed based on the ingredients and good reviews and I am very happy with it. Not only am I getting fiber, I'm getting protein, Omega 3 and all the other good stuff it has. I was a little concerned because it had more calories and I'm overweight, but it is actually helping me lose weight by filling me up.\n\nI've also used it as a meal by mixing it with skim milk and eating it with 7-grain toast with marmalade or a couple of scrambled eggs. I love it mixed with milk. It goes down like a bran muffin in a drink. I also sometimes drink a glass with water 15 minutes before dinner and I noticed I'm able to control my portions much better.\n\nAnother reviewer said it is clumpy, and it is, especially if you wait. That is because fiber absorbs water so as time goes on it gets a little thick. The orange stuff works the same way, so either way you have to drink it quickly or maybe water it down a little and mix it up again (or just drink the thick remainder). OK, it doesn't taste like chocolate cake, but it isn't supposed to. I think this stuff tastes great, especially with milk.\n\nI find that out of the other high fiber foods I've tried (orange stuff, snack bars) this fills me up the best and I feel like my carb cravings have subsided a little.\n\nOver all, I feel my energy level has increased significantly and I have much less mental fog. This isn't due to this particular product per se, but it made it easier for me to increase fiber and lower simple carbs like white flour products and sweets. In addition to this supplement once or twice a day, which is more like a food than a supplement, I'm eating 1 high fiber snack bar a day and trying to eat veggies (I'm allergic to most fruits) at every meal for about 30g of fiber a day. I still eat my favorite bad food (pizza and Chinese food), but I am eating smaller portions-- and not because I'm forcing myself to eat small portions but because I'm full sooner.\n\nI feel great and I'm happy Super Seed is part of my daily diet.", "I am NOT a health nut. I am obese and I trying to get my health/weight/stress levels under control. I also do not have any digestive diseases, however I often suffered from significant discomfort from gas, bloating, constipation, and loose stools. These had been a recent onset in the last year or so, previous to that time, I had no GI upset.\n\nI (very reluctantly) decided that my first round of behavior modification would include getting my digestive system under control by trying to regulate my diet, adding a significant amount of fiber and protein. I was very wary of getting a fiber powder because I don't like gritty textures and don't tolerate \"healthy\" tasting items well either. So I tried this in conjunction with a well-reviewed probiotic.\n\nI cannot express to you how impressed I was with this stuff. It mixes fairly easily (only spoon requires), has TONS of really good stuff for you, and doesn't taste terribly bad. However, here are a few tips:\n\nIf you do not like apples AND cinnamon, you will not like this.\nI find it absolutely disgusting when mixed with just water. It tastes to me like I imagine eating water-y mud would taste like (I literally gagged). However, I can use as little as 4 oz of fruit juice and 8 oz of water and be totally happy with the taste.\nIt tastes fake and almost sour if you mix it with apple juice. Orange, mango, and some combination of peach work wonderfully.\nThat being said, I also highly recommend mixing it with 12 oz or more of liquid if your like me and don't like to drink your apple sauce.\nHIGHLY recommend mixing with ice. Even if it sits out in my hand for a couple of minutes, the combination of thick and luke warm makes me gag.\nTends to settle very quickly, so always stir before you drink (especially important if you do water/juice combo instead of all juice. For whatever reason tends to pull just water to top, cause the water/fiber mixture to gag me). Also, tends to get slimier as well when let to sit more than a minute (also something I have trouble with).\nTo get total relief of my GI symptoms, I have to use twice daily.\n\nDouble BONUS POINTS: It works as a superb appetite suppressant. You really will maintain AT LEAST 4 hours without tummy growling hunger.\n\nAfter some experimentation, I can't live without it. Completely made me a believer!", "I purchased this because it was advertised as being good for diverticulosis. I like the fact that it takes natural food ingredients to add fiber to your diet. I mix it with a little water and it tastes pretty good. It is sweet and fruity. The important thing to remember with this is that it is powerful and you have to know just the right dose for YOU. If you just jump in and start taking it, it will deliver a nightmare from which you won't want to take it again. LOL The instructions should be rewritten to start with a very small amount, like 1 teaspoon or 1/2 teaspoon. Then increase it until you achieve the results you're after. How much fiber supplement you need really depends on how much fiber you have already eaten in your meal. Take this supplement along with your meal. I take it no later than 5 p.m. with my dinner and allow it to work its magic overnight. Flax seed is known to cause diarrhea if you're not used to taking it or other strong fiber supplements. You'll be the most happy with this if you learn to graduate yourself upwards until you find the dose that works for you! Trust me on that. Knowledge is power.", "This stuff is ok. My biggest complaint is it does not mix well at all.", "It’s so healthy I just bought it for health reasons and never expected to like it -figured I’d choke it down.\nSurprise!\nIt’s very delicious when I add it to my morning yoghurt!\n\nThis brand is top too\n\nI say give it a try… I’m super picky and I really enjoy the flavor !"]}, {"link": "https://www.amazon.com/dp/B000JJT9MM", "title": "Orbit 10057W Arizona Outdoor Misting System Cobra Mistand (Colors May Vary)", "img": "https://m.media-amazon.com/images/I/51FNaNhorVL._AC_SX569_.jpg", "ratings": "783 ratings", "description": "The portable Orbit Cobra Mistand provides immediate relief from the heat by producing an ultra-fine mist that cools outdoor temperatures by up to 20 degrees Fahrenheit. Simply attach any standard garden hose to the hose adapter and turn on the water. The Cobra Mistand is available in green and blue.", "reviews": ["This is a really great device for keeping cool. It's perfect for two people sitting on chaise lounge chairs. That said, there is an issue. The first time I used it, it worked great. Both nozzles put out a nice mist just the right amount. Second time I used it, one of the nozzles would not work at all. I live in an area that has hard water so I'm not that surprised that this happened, especially when you think about how super tiny the orifice is on the mist nozzles. I did find a way to make the nozzle work again. I took a shot glass and put about 1/3 of a shot of vinegar in the glass. Then I put the nozzle part into the shot glass making sure the vinegar just covered the nozzles and not go above the end cap. I didn't want the vinegar to possibly effect the glue holding on the cap. I left it overnight and the next day it worked just like the first time. I really like this product, I just hope I don't have to do this every time I used it.", "I hung this is a tree and the hummingbirds loved it. Plus it’s a nice mister to enjoy on the patio; although it needs to sit on something tall if you want it to be above you as you sit, otherwise it’s at head level.", "I finally got to use the outdoor misting system. It only mist on one side the other side sprays out it doesn't mist like the other side does. Not to please with it.\nNot sturdy or strong.\nDoesn't work well!\nIt's easy to use just connect to your hose and turn the hose on.\nGood Luck if you get both misters to work.", "In my quest to get a summer tan and not burn up in the process, I purchased this misting system. I'm very pleased with it. I tan on my deck, which tends to get very hot with not much wind. This product arrived in an extremely large box but it was packaged well and arrived undamaged. Setup was very easy and the product performs as it is supposed to. A fine, cool, mist is sprayed from each side of the end and it really does make the area surrounding it cooler. My only complaint is that this thing does not stand up straight. It leans over rather significantly, but it still works!\n\nI would definitely recommend to anyone looking for an easy way to stay cool this summer.", "One of my friends had one of these and I loved it! She would hook it up while our kids were playing outside on a hot day and she and I would sit comfortably and watch. She would put a box fan behind it when she had parties and everyone on the patio could enjoy a cooling mist. I decided I had to have one, but couldn't find it at any of our local hardware stores. So I came to Amazon, and here it is!\n\nThe downside is that you don't get to pick your color. However, they picked perfectly for me and sent me one that matches the shutters on my house, so I can't really complain! It works very well, is easy to set up, and does just want I want. Putting a box fan behind it ensures that it blows on the right direction instead of relying on the wind. For the price, this item can't be beat!", "A friend of mine was looking for a misting system to leave in her backyard for her outdoor pets during the hot days in Los Angeles. We found this Orbit misting system and figured we would give it a try. It works well and undoubtedly mists the area to keep it cooler. It's a good product for the price. Some of the other misters are very expensive and take some time to install; therefore, if you are looking for a quick, inexpensive mister that works, then I would recommend this product. The only down side is the fact that you cannot pick the color of your choosing, you basically get whatever is sent.", "Granted, you can't compare this mister to those that are more robust and complicated, but for what it is you can't go wrong. We live in the Sacramento region that has very dry, hot summers. We wanted to get a cheap mister that all we had to do is plug the garden hose into... and the fact that this is a free-standing mister (no installation required) sealed the deal.\n\nRight next to the mister (within about 2-3 feet) it is a wet mist that will leave you feeling a little damp (but cool and comfortable). However, just a little further away you get the cooling without much dampness. The less wind, the better it seems to cool, but a slight breeze doesn't render it useless. It is extremely convenient in that it is reasonably portable.\n\nAn unintended benefit of this mister is that the infant/toddlers that frequented our back yard last summer loved playing with the mister... putting their finger over the nozzle, letting it spray in their faces, etc. It was one of the biggest hits in the back yard for play and for staying cool. It has easily held up to the abuse as well!", "It didn’t come with a washer so water would leak everywhere. We used a washer from an old sprinkler that we had and it worked fine. Great for the garden or to cool off a bit on a hot summer day.", "We use this mister (there are only two little metal mister nozzles at the top) for keeping the pets cool in the heatwave months. The summers get very hot and dry and our three pets hang around the cool water spray most of the day. The water hose can be turned on with just a little pressure and works all day long to provide a fine mist from the top. The wild birds flock to get drinks of water from the mist that falls on the grass. The mister we received was purple and the base is a bit wobbly so we have to use something to prop it on one end to keep from tipping; but there haven't been any issues yet from it falling over. The wobbling is the only issue keeping this at 4 stars instead of 5.", "Living in the South, this mister provides relief when working outside in the yard or just sitting outside reading in the summer. Unlike other misters I have tried, this one doesn't leak when you put it on the hose. Some of these products have a tendency to not be able to thread with your hose sufficiently, thus having leaks and wasting precious water. This provides an even light misting to cool you off without getting soaked. The best part is since the pressure on this is so even, once you turn off your hose, it still provides a mist for about 20-30 minutes later.", "Should keep our patio area a little cooler, but I mostly bought it for the hummingbirds I feed. Hopefully they like it. It was missing the washer, which is the first thing the directions ask you to look for. Not hard to fix, just run to the hardware store and pick up some hose washers, but still annoying. That's why I'm taking off one star. Oh, Just a heads up, it comes in a giant box since this product isn't flexible.", "Works great and easy to set up. I had a MistyMate 10 which has 6 (plastic) misters you screw into 10' of small tubing, right out of the box half of the misters were broken. Not wanting to deal with buying new misting heads, I decided to give this a try. This thing is awesome ! Easy to set up and it doesn't use a lot of water. The best part is, its so portable to move it around where ever you need it. My wife uses it when she sunbathes and when she is thru with it, I move it over to the dog kennel. We have used it all day, everyday for weeks and only once has one of the \"brass\" nozzles clogged up but, a small peice of wire cleared it. I also bought some Gilmore Metal Hose Coupling Filter Washers which helps to filter out any larger size debris.", "I bought this for my daughters birthday party. It was supposed to be over 90 degrees and we had a bounce house so I was afraid the little kids would be over heated. We put this at the end part of the slide so the kids could go through it. Definately was a good idea for us! The kids even fought over it at times and it held up fine (didn't fall apart or anything) . Very light and portable. We put a brick on it to keep it stablized but it wasn't necessary. The kids ended up moving the brick and carrying it all over the place anyways. (or as long as the hose could go) I don't know, long term, the durablity of it since I only used it once so far, but it seems that it would last for a while.", "This works pretty well although I have only tested it a couple times because it's not quite warm enough to use it regularly yet. I purchased this to place near my chicken's run to help cool them off during the hot summer months. The only negative thing I will say so far is that it is slightly bent which causes it so fall over- which is annoying. I have to lean it against something to keep it upright. I will update this post in July or August when it's used regularly.", "This is EXACTLY what we needed. We didn't want to pay a ton of money for an overhead sprinkler system and then we saw these. We are in hot hot south texas weather and we have chickens that need to stay cool. I bought two of these and set them about 25 foot apart in the chicken yard. They hooked up nicely, did not leak, good material, and the mist is so thin it did not even get the coop wet that was only 5 foot away. There was an obvious drop in temperature right away. My chickens come out during the day now instead of staying hidden until evening when the temperature goes down. They are enjoying their yard again and I am enjoying my hens again. THANK YOU! Could not believe how inexpensive such an effective product could be!", "Very surprised by this. It is not going to cover a large space or anything like that but if you are sun bathing or sitting outside this is fantastic. Well worth the money. My toddler thinks it's amusing to put his hand in the mist and get wet. So it is safe around kids. Worst thing they can do is knock it over. It's quite steady by itself due to the design", "OG Floridian here, and I seriously can not take the summer heat without this. I just bring it around with me as I garden, or right next to my chair when I'm laying out. Perfection!", "The misting stand is overall a nice item, and it cools off the area, but it continuously falls over and has to be picked up. I have 3 others that are made with bendable material and these don't have a problem, so I think it is just the fact that it is not stable on a surface that is not flat. So if you are purchasing for a flat surface and not a uneven lawn then this would be a great purchase. Also the other thing I noticed different about this one compared to the other Orbit Misting Stands I have is that the misting holes were on the top and the others that I have are on the nose.", "This summer has been brutally hot on the western shores of Lake Michigan where I slip my sailboat. On a particularly muggy Saturday a few weeks ago I ventured over to a little gathering of my dockmates who happened to have a couple of these set up to cool off the guests. It took me about 5 minutes to log onto Amazon.com and get one of these bad boys on the way! As is often the case, my sailing days since have been spent in the mid-70's so I haven't had a chance to break mine out yet but, given my initial experience with the mister, I'm looking forward to comfortable cocktail hours from here on in! The misting jets are adjustable from a fine vapor up to a pretty good spray. Another one of those million dollar ideas that I wish I had! Fantastic product at a more than reasonable price!", "I have owned a mister like this before years ago. I have been looking for one like I had before. It is easy to attach to the water hose and mists well. I bought this two fold. The heat where I live has been almost unbearable. I actually bought two. I use it for my plants which does not seem to get enough water. It is also great when outside and I need a little water misting on myself."]}]}