{
    "products": [
        {
            "link": "https://www.amazon.com/dp/B000052YIN",
            "title": "Gillette Series 3X Protection Shave Foam, Sensitive, 9 Ounce (Pack of 6)",
            "ratings": "231 ratings",
            "description": "Go easy on your sensitive skin with Gillette Series Sensitive Skin shave foam with aloe. The formulation delivers astonishing razor glide with its Triple Protection formula. It has a rich lather to help protect, lubricants for smooth glide, and it hydrates hair for easy cutting. So you get a smooth shave that's comfortable.",
            "reviews": [
                "Lo económico que resulta",
                "Have been using Gillette Foamy Shave Cream formulated for 'Sensitive Skin' for many years. And for just as long, have always set the can in the sink of medium hot water to warm up the cream before shaving. Never had one explode yet! My last order (from a different vendor) were different in the fact that there were no foil/paper labels on the cans, the labels were directly printed on the metallic cans and I never had to worry about the labels peeling off in the hot water. I noticed that this set of shaving cream have the foil/paper labels, so I suspect they are going to peel after a couple of uses, but no big deal. Just wish there would have been a way to know this before ordering.",
                "I made the mistake of purchasing this product, and meant to get the Gillette Series gel. I didn't know Gillette Series made shaving foam, too. Nevertheless, my rating of this product is not a reflection of my not knowing this (read: I will try to be as impartial as possible here!). I have since used this product, and it definitely is better than the foams I've used in the past. However, as other reviewers have noted, it's not as \"rich\" or full-bodied when it comes out of the can. The 'instructions' (nothing more than a graphic) does not say whether or not to shake the can (as with other foams). Either way (shake or no shake), when you dispense the product, it comes out rather thin, but seems to thicken up a bit, after a second or two. Overall, it's good foam, and I'd give it a higher rating if it wasn't for the 'watery' consistency when it comes out of the can. This can be a (minor) issue at first, as some if it might fall into the sink if you dispense it took quickly (as I have, before I got the hang of it and learned not to press the button too firmly).\n\nIn summary:\n* If you like foam, you may like this one. 3 stars for now, 4 1/2 stars if they can reformulate it to not be so runny upon dispensing.\n* If you prefer gel (as I do), you probably won't like it. However, I suggest trying it out buy buying a single can first, to see if you'd like it.",
                "I've been using this cream for some time now and I just realized I was able to get it in bulk packs and subscription services. I hate going out to the store to buy things like this (mainly because I wait until I'm out), so the subscription is good. If you are like me with 5 men in the house, you can probably use the six cans pretty easily. We aren't even that hairy of a bunch, so your mileage may vary based on your level of wolverinism and the number people you have.\n\nIn terms of the cream itself, I'm a big fan of foam over gel as you don't have to wait for it to foam, you get a better idea of how much you are using and I think it works better to lubricate and hydrate the face. Gillette's is good at all that. I don't have sensitive skin, but I've always used this because it seems easier on my face and it provides for a smooth shave.\n\nEverything said the cream itself is great, but a 6pk is a lot of shaving cream. Great if you have a lot of guys around (better yet if they are particularly hairy).",
                "Nice value for the dollar.\nNot sure what \"sheerness\" and \"thickness\" have to do with shaving cream so I can't \"rate\" them.\nI've used this cream exclusively for some time and it works well.",
                "This is a great shaving cream foam. Was worried it was going to be the gel.",
                "Gillette Sensitive Skin is my \"go-to\" brand when traveling and being able to grab six of them at slight less than $3.25 each rather than $2.30 for singles makes it easy for me to stock up. It is like getting almost three FREE cans with a three can purchase. Shelf life is not a problem either if kept in a cool place. No, the garage is a bad idea as is over the stove or on the mantle above the fireplace. This is a good deal.",
                "I wasn't able to buy my usual shaving foam (Barbasol) here on amazon.com without paying shipping and handling because for some reason only outside vendors carry it, so I decided to give something else a try, and this seemed like the best value. I haven't experienced any of the watery issues that some other reviewers have, and I wonder if it's perhaps because I hold the can upside down and shake vigourously before each use. Take note, this is a foam, not a gel, and it comes out all foam. I use it on my face and my head, and it does the job, with no bad smell or irritation. Not much you can say...it's shaving foam. It is what it is.",
                "I switched to the gel style shave products many moons ago when they first became popular. Then recently, by accident, I picked one of these Gillete foam styles off the store shelf. Because I didn't realize my mistake until a couple of weeks later, I decided to use it. I was pleasantly surprised to discover how much closer and easier it shaved compared to the gels. I tried brand B foam later and it seemed to be more air less moisture. The Gillete product does come out less puffed up, which is due, I'm speculating, to a higher moisture content. So the Gillette Foam is now my daily shave product.",
                "The can looked like the one he likes however it wasn't the gel he thought it would be. He still uses it and says it's ok.",
                "The item arrived when I was notified it would arrive - in a timely manner. Looks like I am all set with shaving cream for the near future.",
                "I've used Gillette Series foam for years...have never been a fan of gels. I get a great shave with the foam, and with a lot less mess, and a lot less odor. I can't believe that a product as good as this is so hard to find. Well, not anymore with Amazon.",
                "I ordered this six pack in 2012 and JUST popped open that sixth can. So keep that in mind if you're trying to order in bulk to save money, this purchase is probably way longer term than you're thinking. Also, I thought I was buying the gel, but this is the cream.",
                "Couldn't find this in Walmart or Riteaid anymore so looked for it on amazon. Had to buy the six pack, but since it doesn't really expire I'll be set for a few years, haha. I like this cream because it doesn't clog my Gillette fusion razor like the foaming gel does.",
                "Shaving",
                "My absolute favorite shaving cream. I have sensitive skin on my neck, and this one is waaaaaay better than gels, which seem to bog down my electric razor. These will probably last a couple of years",
                "Purchased for a sensory item for play.",
                "This stuff is classic, works great and is impossible to find anymore even in the million drugstores of NYC. I hope they are not dis-continuing the product. It seems only the razor-clogging gels are being sold in NYC these days, so I had to buy 6 cans of these just so I could get what I wanted!",
                "Been using these for years now. A little goes a long way. Comes out like water then foams up. This is important to note so that you do not dispense too much after thinking there was no foam coming out. I find it better to shake the can 2 or 3 times (not excessively) to make it foam up quicker.",
                "This product is great. The price was right and the shaves are great."
            ],
            "img": "https://m.media-amazon.com/images/I/51+byPR+iTL._SY300_SX300_.jpg"
        },
        {
            "link": "https://www.amazon.com/dp/B00005308K",
            "title": "Secret Original Anti-Perspirant/Deodorant, Invisible Solid, Powder Fresh, 2.6-Ounces",
            "ratings": "1,343 ratings",
            "description": "Aluminum Zirconium Trichlorohydrex GLY. Invisible sheer dry strength.",
            "reviews": [
                "This is the best I have found. It has a light scent and lasts all day. I will keep ordering.",
                "The deodorant works well but you must turn a knob on the bottom to get it out and in the beginning it is impossible to turn. I was disappointed that I bought this.",
                "I have struggled with hyperhydrosis my whole life. I was bullied in school for my large pit-stains, and would always have wet circles under my pits, regardless of the temperature outside. I went through several prescriptions from my doctor, which only irritated my skin and made it itch and burn like fire, preventing me from sleep. I received a sample of this product through a female care sample pack through a clinic, and fell in love. I have now been using this deodorant for almost 10 years, and have never been happier with a deodorant. Yes, I still do sweat if it's really hot out, or while working, but that's to be given with any deodorant I believe. Applying this product at night and in the morning has solved the huge wet circles I was always embarrassed of.\n\nAlso, this product smells fantastic, and has not irritated my skin even after applying twice daily. I am so happy with this, that i haven't, and won't search for anything else. This is it for me!",
                "I was given a trial of this somewhere. I forgot about it and when I used it, it was a bit dry and hard to get out, but worked well. Now that I have a fresh one, it it much nicer to use! I only roll it up one \"click\" and put it on; you don't need much. But, my complaint is how darn hard it is to turn that dial, If you have hand issues, this may not be for you. I do not like smells in my products, but bought this because people said the smell was light and i either couldn't find or didn't want the fragrance free one (cannot remember now). The fragrance is not bad. It is lighter than many and doesn't smell for long. That said, if you are sensitive to fragrance, it is noticeable when you put it on.\n\nHave no idea how long it will last - given it's price, I hope longer than the last kind I used.",
                "Been using exactly this brand, exactly this scent since it came out. This deodorant, seriously changed my whole life. I have always been a sweaty armpit person (not a smelly sweaty, but constant sweat), and was SO insecure about it. All through junior high and high school I always wore a jacket over clothes, and didn't like wearing anything but colors that could hide the sweat, which was there even in the middle of winter. I put this on after showering, and don't have to reapply until my next shower, even if that is two days later. I thought maybe I grew out of the problem, but have tried over the years not using it, and a couple of times have forgotten it when I traveled, and I definitely still sweat like crazy. No other deodorant works even a little for me. This is THE ONLY one I can use with success. And it smells awesome! People sometimes ask me what perfume I'm wearing, and I tell them it's my D.O., haha. I don't like the other scents this deodorant has, and have a special aversion to the 'powder' scent (gag).",
                "Definitely one of my best and trusted tried and true, Go-Tod. Easy application, lasts longer than competitors, nice scent, and great odour protection!",
                "This has been my favorite deodorant for years, but now that we’ve moved from the desert to a warm humid climate this is a life saver. I’ve tried switching to the more natural (aluminum free) deodorants that everyone raves about, but I end up smelling and with soaked T-shirt’s. Secret clinical strength never fails me, and I love the fresh light scent that doesn’t overpower. I can wear this deodorant on a day I’m nauseous no issues, and if I’m wearing perfume it doesn’t clash like some stronger smelling brands of deodorant have in the past.",
                "Can go up to 2 days without sweating ..I've tried natural deoderants and aluminum free but I hate the feeling of wet pits..keeps me super dry and the smell is so fresh ..my favorite..definitely worth the cost",
                "I love this deodorant. The smell is delicate and pleasant. It works well. I had to wait 4 weeks to get it but it was worth the wait.",
                "I dislike the overpowering fragrance of most depressant but I appreciate a light scent versus unscented. This is the perfect balance and it does and excellent job",
                "It's a very good product and does what it says so long as you follow directions. I used this in preparation for a summer wedding and I'm so glad I did. Just remember you have to start using well before the date of your event in order for it to be fully effective though I have used it on shorter notice occasionally and it still seems to work fine. Amazon occasionally has a coupon that can make this really cheap so clip it and just add one of these to your prime or free shipping order since it's an add-on item and will only cost a few bucks. It's worth it to have one on hand when you need it.",
                "i'm somewhat disappointed with the scent. To me, it really doesn't smell like lavender. Now I wish I'd gotten (if they have it) the \"clean\" scent in the clear gel. The scent It isn't bad, I just wanted something \"pretty\" like my last one (which was called \"Paris\"). But, I didn't see that one. As for the antiperspirant part, it's decent but could be better.",
                "Have used this for years bit was buying in Amazon. This sounded like a good scent. I needed some and like it. It is not a heavy scent",
                "Gentle fragrance and works all day well.",
                "Useful and easy.",
                "Wasn't sure of the directions at first, of it was two clicks for each arm or one for each. The feeling of the deodorant is a little strange at first, but it does feel dry when it goes on, almost too dry.\n\nI reapplied about half a click to both arms in the morning because I didn't trust it to last throughout the next day as well and I was right. I was sweating all day and smelled by the end of the day. Now this could be because I didn't use it right, I'm not sure. These deodorants always speak to the sweating, but not the odor which is my main concern.\n\nI will increase two two clicks each arm day and night. This means I will be out of deodorant by next week probably with tiny amount that's in there, but it's worth a try.",
                "I am trying out new deodorants because my old, reliable deodorant, Arrid XX Dry changed its formula. I tried Secret because it's the best seller on Amazon. So far this product is just okay. Good points:\n- The lavender scent is mild and pleasant, not overpowering.\n- It seems to keep me smelling fresh.\n\nI'm not giving it a higher rating because:\n- The gel is extremely sticky/tacky and stays that way all day without ever absorbing into my skin although I apply a very small amount (1-click). I wash it off before bed because the stickiness is unpleasant.\n- It transfers to my clothing, leaving a dark, hardened spot on the fabric, which is very undesirable. I let it dry for about 30 minutes before dressing and it still transfers.",
                "This is the best deodorant i’ve been using it for years. Love the smell and it really controls perspiration. Wouldn’t change it!",
                "Arrived exactly as advertised",
                "Love this stuff but the one time I buy it online and the container itself is broken. Won't roll up or down and the piece of plastic in the middle is poking out at the top. Ugh...smh"
            ],
            "img": "https://m.media-amazon.com/images/I/41ddNlDqsTL._SX425_.jpg"
        }
    ]
}